Repository: SekouD/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: es, fr, it, ro

source: Contributing
es: Contribuir
fr: Contribuer
it: Contribuire
ro: Contribuind

source: Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given.
es: Las contribuciones son bienvenidas, y son muy apreciadas. Todo ayuda, y el crédito siempre se dará"
fr: Les contributions sont les bienvenues, et elles sont grandement appréciées! Chaque petit coup de pouce aide, et le crédit sera toujours donné.
it: I contributi sono ben accetti e sono molto apprezzati! Ogni piccolo aiuto e il credito verrà sempre dato"
ro: Contribuțiile sunt binevenite și sunt foarte apreciate! Fiecare ajutor mic și creditul vor fi întotdeauna acordate"

source: You can contribute in many ways:
es: Puedes contribuir de muchas maneras:
fr: Vous pouvez contribuer de plusieurs façons:
it: Puoi contribuire in molti modi:
ro: Puteți contribui în multe feluri:

source: Types of Contributions
es: Tipos de contribuciones
fr: Types de contributions
it: Tipi di contributi
ro: Tipuri de contribuții

source: Report Bugs
es: Reportar errores
fr: Signaler les bugs
it: Segnala bug
ro: Raportează bug-uri

source: Report bugs at https://github.com/SekouD/mlconjug/issues.
es: Informar de errores en https://github.com/SekouD/mlconjug/issues"
fr: Signaler les bugs sur https://github.com/SekouD/mlconjug/issues.
it: Segnala bug a https://github.com/SekouD/mlconjug/issues.
ro: Raportați bug-uri la adresa https://github.com/SekouD/mlconjug/issues"

source: If you are reporting a bug, please include:
es: Si informa un error, por favor incluya:
fr: Si vous signalez un bug, veuillez inclure:
it: Se stai segnalando un bug, includi:
ro: Dacă raportați un bug, vă rugăm să includeți:

source: Your operating system name and version.
es: El nombre y la versión de su sistema operativo"
fr: Le nom et la version de votre système d'exploitation.
it: Nome e versione del tuo sistema operativo.
ro: Numele și versiunea sistemului de operare.

source: Any details about your local setup that might be helpful in troubleshooting.
es: Cualquier detalle sobre su configuración local que pueda ser útil para solucionar problemas"
fr: Tous les détails sur votre configuration locale qui pourraient être utiles pour le dépannage.
it: Qualsiasi dettaglio sulla configurazione locale che potrebbe essere utile nella risoluzione dei problemi.
ro: Orice detalii despre configurația dvs. locală care ar putea fi de ajutor în rezolvarea problemelor.

source: Detailed steps to reproduce the bug.
es: Pasos detallados para reproducir el error"
fr: Les étapes détaillées pour reproduire le bug.
it: Passaggi dettagliati per riprodurre il bug.
ro: Pași detaliați pentru a reproduce bug-ul.

source: Fix Bugs
es: Corregir errores
fr: Corriger les bugs
it: Bug corretti

source: Look through the GitHub issues for bugs. Anything tagged with "bug" and "help wanted" is open to whoever wants to implement it.
es: Revise los problemas de GitHub para detectar errores. Cualquier cosa etiquetada con " error \ "y " ayuda deseada \ "está abierta para quien quiera implementarla.
fr: Consultez le depot GitHub pour voir si il y a des bugs en attente de correction. Tout ce qui est étiqueté "bug" et "help wanted" est ouvert à quiconque veut l'implémenter.
it: Cerca tra i problemi di GitHub per i bug. Qualsiasi cosa taggata con " bug \ "e " help wanted \ "è aperta a chiunque voglia implementarla.
ro: Uita-te prin problemele GitHub pentru bug-uri. Orice etichetat cu " bug \ "si " help wanted \ "este deschis oricui vrea sa o implementeze.

source: Implement Features
es: Implementar características
fr: Implémenter de nouvelles fonctionnalités
it: Implementa funzionalità
ro: Caracteristicile implementării

source: Look through the GitHub issues for features. Anything tagged with "enhancement" and "help wanted" is open to whoever wants to implement it.
es: Revise los problemas de GitHub para ver las características. Todo lo que esté etiquetado con " mejora \ "y " ayuda deseada \ "está abierto a quien quiera implementarlo.
fr: Consultez GitHub pour voir si le projet est en attente de nouvelles fonctionnalités. Tout ce qui est étiqueté avec "enhancement" et "help wanted" est ouvert à quiconque veut l'implémenter.
it: Cerca tra i problemi di GitHub per le funzionalità. Qualsiasi cosa taggata con " enhancement \ "e " help wanted \ "è aperta a chiunque voglia implementarla.
ro: Uitați-vă la problemele GitHub pentru caracteristici. Orice etichetat cu " îmbunătățire \ "și " help wanted \ "este deschis oricui dorește să îl implementeze.

source: Write Documentation
es: Escribir documentación
fr: Ecrire de la documentation
it: Scrivi documentazione
ro: Scrierea documentației

source: MLConjug could always use more documentation, whether as part of the official MLConjug docs, in docstrings, or even on the web in blog posts, articles, and such.
es: MLConjug siempre podría usar más documentación, ya sea como parte de los documentos oficiales de MLConjug, en docstrings, o incluso en la web en publicaciones de blogs, artículos, etc.
fr: MLConjug pourrait toujours utiliser plus de documentation, que ce soit dans la documentation officielle de MLConjug, dans les docstrings, ou même avec une mention sur des blogs, articles et autres.
it: MLConjug potrebbe sempre usare più documentazione, sia come parte dei documenti ufficiali di MLConjug, in docstrings, o anche sul Web in post di blog, articoli e simili.
ro: MLConjug ar putea folosi întotdeauna mai multă documentație, fie ca parte a documentelor oficiale MLConjug, în docstrings, sau chiar pe web în bloguri, articole și altele.

source: Submit Feedback
es: Enviar comentarios
fr: Soumettre des commentaires
it: Invia feedback
ro: Trimite parerea ta

source: The best way to send feedback is to file an issue at https://github.com/SekouD/mlconjug/issues.
es: La mejor forma de enviar comentarios es presentar un problema en https://github.com/SekouD/mlconjug/issues"
fr: La meilleure façon d'envoyer vos commentaires est de remplir une "issue" sur https://github.com/SekouD/mlconjug/issues.
it: Il modo migliore per inviare feedback è presentare un problema su https://github.com/SekouD/mlconjug/issues.
ro: Cea mai bună modalitate de a trimite feedback este să trimiteți o problemă la adresa https://github.com/SekouD/mlconjug/issues.

source: If you are proposing a feature:
es: Si estás proponiendo una función:
fr: Si vous proposez une fonctionnalité:
it: Se stai proponendo una funzione:
ro: Dacă propui o caracteristică:

source: Explain in detail how it would work.
es: Explica en detalle cómo funcionaría"
fr: Expliquez en détail comment cela fonctionnerait.
it: Spiega in dettaglio come funzionerebbe.
ro: Explicați în detaliu modul în care ar funcționa.

source: Keep the scope as narrow as possible, to make it easier to implement.
es: Mantenga el alcance lo más estrecho posible, para que sea más fácil de implementar"
fr: Gardez la portée aussi minime que possible, pour rendre la fonctionnalité plus facile à mettre en œuvre.
it: Tieni l'ambito il più stretto possibile, per renderlo più facile da implementare.
ro: Țineți cât mai restrâns domeniul de aplicare, pentru a facilita implementarea acestuia"

source: Remember that this is a volunteer-driven project, and that contributions are welcome :)
es: Recuerda que este es un proyecto impulsado por voluntarios, y que las contribuciones son bienvenidas :)
fr: Rappelez-vous qu'il s'agit d'un projet mené par des bénévoles, et que les contributions sont les bienvenues :)
it: Ricorda che questo è un progetto guidato dai volontari e che i contributi sono i benvenuti :)
ro: Amintiți-vă că acesta este un proiect bazat pe voluntari și că contribuțiile sunt binevenite :)

source: Get Started!
es: ¡Empezar!
fr: Commencez!
it: Iniziare!
ro: Incepe!

source: Ready to contribute? Here's how to set up `mlconjug` for local development.
es: ¿Listo para contribuir? Así es cómo configurar` mlconjug` para el desarrollo local "
fr: Prêt à contribuer? Voici comment configurer `mlconjug` pour le développement local.
it: Pronto a contribuire? Ecco come impostare` mlconjug` per lo sviluppo locale.
ro: Ați venit să contribuiți? Iată cum puteți crea" mlconjug "pentru dezvoltarea locală.

source: Fork the `mlconjug` repo on GitHub.
es: Tenedor el repositorio` mlconjug` en GitHub.
fr: Forkez le dépôt `mlconjug` sur GitHub.
it: Prepara il repo 'mlconjug` su GitHub.
ro: Reportați repo-ul" mlconjug "pe GitHub.

source: Clone your fork locally::
es: Clona tu tenedor localmente::
fr: Cloner votre fork localement::
it: Clona la tua forcella localmente ::
ro: Clonează-ți furca pe plan local

source: Install your local copy into a virtualenv. Assuming you have virtualenvwrapper installed, this is how you set up your fork for local development::
es: Instale su copia local en un virtualenv. Suponiendo que tiene virtualenvwrapper instalado, así es como configura su tenedor para el desarrollo local ::
fr: Installez votre copie locale dans un virtualenv. Si vous avez installé virtualenvwrapper, voici comment configurer votre fork pour le développement::
it: Installa la tua copia locale in un virtualenv. Supponendo che hai virtualenvwrapper installato, questo è il modo in cui imposti la tua forcella per lo sviluppo locale ::
ro: Instalați-vă copia locală într-o virtualenv. Presupunând că aveți instalat virtualenvwrapper, acesta este modul în care vă configurați furculița pentru dezvoltarea locală:

source: Create a branch for local development::
es: Crear una sucursal para el desarrollo local ::
fr: Créer une branche pour le développement local::
it: Crea un ramo per lo sviluppo locale ::
ro: Creați o sucursală pentru dezvoltarea locală:

source: Now you can make your changes locally.
es: Ahora puedes hacer tus cambios localmente"
fr: Vous pouvez maintenant faire vos changements localement.
it: Ora puoi apportare le modifiche localmente.
ro: Acum puteți face schimbările la nivel local.

source: When you're done making changes, check that your changes pass flake8 and the tests, including testing other Python versions with tox::
es: Cuando hayas terminado de hacer cambios, verifica que tus cambios pasen a flake8 y las pruebas, incluida la prueba de otras versiones de Python con tox ::
fr: Lorsque vous avez fini de faire vos changements, vérifiez que vos changements passent flake8 et les tests, y compris les test d'autres versions de Python avec tox::
it: Quando hai finito di fare modifiche, controlla che le tue modifiche superino flake8 e i test, incluso testare altre versioni di Python con tox ::
ro: Când ați terminat de făcut modificări, verificați dacă modificările dvs. trec prin flake8 și testele, inclusiv testarea altor versiuni Python cu tox ::

source: To get flake8 and tox, just pip install them into your virtualenv.
es: Para obtener flake8 y tox, solo pip instálalos en tu virtualenv"
fr: Pour obtenir flake8 et tox, il suffit de les installer dans votre virtualenv.
it: Per ottenere flake8 e tox, basta installarli nel tuo virtualenv.
ro: Pentru a obține flake8 și tox, pur și simplu instalați-le în virtualenv.

source: Commit your changes and push your branch to GitHub::
es: Confirme sus cambios y envíe su sucursal a GitHub ::
fr: Validez vos modifications en faisant un commit et faites un push de votre branche sur GitHub::
it: Confida le tue modifiche e invia il tuo ramo a GitHub ::
ro: Comutați modificările și împingeți sucursala dvs. în GitHub ::

source: Submit a pull request through the GitHub website.
es: Presentar una solicitud de extracción a través del sitio web de GitHub"
fr: Soumettre une requête pull (pull request) sur le site Web de GitHub.
it: Invia una richiesta di pull tramite il sito Web GitHub.
ro: Trimiteți o solicitare de tragere prin intermediul site-ului GitHub.

source: Pull Request Guidelines
es: Pautas de solicitud de extracción
fr: Directives sur les Pull Request
ro: Instrucțiuni de solicitare trageți

source: Before you submit a pull request, check that it meets these guidelines:
es: Antes de enviar una solicitud de extracción, verifique que cumpla con estas pautas:
fr: Avant de soumettre une requête pull, vérifiez qu'elle respecte les consignes suivantes:
it: Prima di inviare una richiesta di pull, controlla che soddisfi le seguenti linee guida:
ro: Înainte de a trimite o solicitare de tragere, verificați dacă respectă aceste linii directoare:

source: The pull request should include tests.
es: La solicitud de extracción debe incluir pruebas"
fr: La requête pull doit inclure des tests.
it: La richiesta di pull dovrebbe includere test.
ro: Cererea de tragere ar trebui să includă teste.

source: If the pull request adds functionality, the docs should be updated. Put your new functionality into a function with a docstring, and add the feature to the list in README.rst.
es: Si la solicitud de extracción agrega funcionalidad, los documentos deben actualizarse. Ponga su nueva funcionalidad en una función con un docstring, y agregue la función a la lista en README.rst.
fr: Si la requête pull ajoute des fonctionnalités, les documents doivent être mis à jour. Mettez votre nouvelle fonctionnalité dans une fonction avec une docstring et ajoutez la fonctionnalité à la liste dans README.rst.
it: Se la richiesta pull aggiunge funzionalità, i documenti dovrebbero essere aggiornati. Inserisci la tua nuova funzionalità in una funzione con una docstring e aggiungi la funzione all'elenco in README.rst.
ro: Dacă cererea de trasare adaugă funcționalitate, documentele trebuie să fie actualizate. Puneți noua funcție într-o funcție cu un docstring și adăugați caracteristica în lista în README.rst.

source: The pull request should work for Python 3.3, 3.4, 3.5 and 3.6. Check https://travis-ci.org/SekouD/mlconjug/pull_requests and make sure that the tests pass for all supported Python versions.
es: La solicitud de extracción debería funcionar para Python 3.3, 3.4, 3.5 y 3.6. Consulte https://travis-ci.org/SekouD/mlconjug/pull_requests y asegúrese de que las pruebas se aprueben para todas las versiones compatibles de Python.
fr: La requête pull devrait fonctionner pour Python 3.3, 3.4, 3.5 et 3.6. Vérifiez sur https://travis-ci.org/SekouD/mlconjug/pull_requests et assurez-vous que les tests passent pour toutes les versions de Python supportées.

source: Tips
es: Consejos
fr: Conseils
it: Suggerimenti
ro: Sfaturi

source: To run a subset of tests::
es: Para ejecutar un subconjunto de pruebas ::
fr: Pour exécuter un sous-ensemble de tests::
it: Per eseguire un sottoinsieme di test ::
ro: Pentru a rula un subset de teste ::
