Repository: SekouD/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/history.po
Languages: es, fr, it, pt, ro

source: History
es: Historia
fr: Historique
it: Storia
pt: História
ro: Istorie

source: Updated `Type annotations`_ to the whole library for PEP-561 compliance.
es: Se actualizaron `Type annotations`_ a toda la biblioteca para cumplir con PEP-561.
fr: Mise à jour `Type annotations`_ pour conformité PEP-561.
it: Aggiornato `Scrivi annotazioni`_ sull'intera libreria per la conformità PEP-561.
pt: Atualizado `Anotações de tipo`_ para toda a biblioteca para conformidade com o PEP-561.
ro: Actualizați "Adnotați tip" la întreaga bibliotecă pentru conformitatea cu PEP-561.

source: Minor Api enhancement (see `API documentation`_)
es: Mejora de API menor (ver `API documentation`_)
fr: Amélioration mineure de l'Api (voir `documentation de l'API`_)
it: Miglioramento di Api minori (vedere `Documentazione API`_)
pt: Aperfeiçoamento de APIs menores (consulte `Documentação da API`_)
ro: Aplicația Minor Api (consultați documentația API)

source: Updated the conjugation models for Spanish and Portuguese.
es: Actualizado los modelos de conjugación para español y portugués.
fr: Mise à jour des modèles de conjugaison pour l'espagnol et le portugais.
it: Aggiornati i modelli di coniugazione per lo spagnolo e il portoghese.
pt: Atualizados os modelos de conjugação para espanhol e português.
ro: Actualizate modelele de conjugare pentru spaniolă și portugheză.

source: Internal changes to the format of the verbiste data from xml to json for better handling of unicode characters.
es: Cambios internos en el formato de los datos verbales de xml a json para un mejor manejo de los caracteres Unicode.
fr: Changements internes du format des données verbistes de xml à json pour une meilleure gestion des caractères Unicode.
it: Modifiche interne al formato dei dati verbiste da xml a json per una migliore gestione dei caratteri Unicode.
pt: Alterações internas no formato dos dados verbiste de xml para json para melhor manipulação de caracteres unicode.
ro: Modificări interne la formatul datelor verbice de la xml la json pentru o mai bună manipulare a caracterelor unicode.

source: New class ConjugManager to more easily add new languages to mlconjug.
es: Nueva clase ConjugManager para agregar más fácilmente nuevos lenguajes a mlconjug.
fr: Nouvelle classe ConjugManager pour ajouter plus facilement de nouvelles langues à mlconjug.
it: ConjugManager di nuova classe per aggiungere più facilmente nuove lingue a mlconjug.
pt: Nova classe ConjugManager para adicionar mais facilmente novos idiomas ao mlconjug.
ro: Noua clasă ConjugManager pentru a adăuga mai ușor limbi noi în mlconjug.

source: Updated all provided pre-trained prediction models:
es: Se actualizaron todos los modelos de predicción preparados previamente:
fr: Mise à jour de tous les modèles de prédiction pré-entrainés fournis:
it: Aggiornati tutti i modelli di previsione pre-formati forniti:
pt: Atualizado todos os modelos de previsão pré-treinados:
ro: Actualizate toate modelele de predicție pre-instruire furnizate:

source: Implemented a new vectrorizer extracting more meaningful features.
es: Implementado un nuevo vectrorizer que extrae características más significativas.
fr: Implémentation d'un nouveau vectrorizer extrayant des fonctionnalités plus significatives.
it: Implementato un nuovo vectrorizer che estrae funzionalità più significative.
pt: Implementei um novo vectrorizer, extraindo recursos mais significativos.
ro: Implementat un nou vectrorizer care extrage caracteristici mai semnificative.

source: As a result the performance of the models has gone through the roof in all languages.
es: Como resultado, el rendimiento de los modelos ha aumentado en todos los idiomas.
fr: En conséquence, les performances des modèles ont nettement augmenté dans toutes les langues.
it: Di conseguenza, le prestazioni dei modelli hanno attraversato il tetto in tutte le lingue.
pt: Como resultado, o desempenho dos modelos passou pelo teto em todos os idiomas.
ro: Ca rezultat, performanța modelelor a trecut prin acoperiș în toate limbile.

source: Recall and Precision are intesimally close to 100 %. English being the anly to achieve a perfect score at both Recall and Precision.
es: La recuperación y la precisión están íntimamente cerca del 100%. El inglés es el único en lograr un puntaje perfecto en Recall y Precision.
fr: Le rappel et la précision sont intimement proches de 100%. L'anglais étant le seul à atteindre un score parfait à la fois en Recall et Precision.
it: Recall e Precision sono intimamente vicini al 100%. L'inglese è l'unico a ottenere un punteggio perfetto sia in Recall che in Precision.
pt: Recall e Precision estão intimamente próximos de 100%. Inglês sendo o único a alcançar uma pontuação perfeita em ambos Recall e Precision.
ro: Recall și Precision sunt aproape de 100%. Limba engleză fiind singura pentru a obține un scor perfect atât la Recall, cât și la Precizie.

source: Major API changes:
es: Principales cambios de API:
fr: Principales modifications de l'API:
it: Principali modifiche API:
pt: Principais alterações da API:
ro: Principalele modificări API:

source: I removed the class EndingCustomVectorizer and refactored it's functionnality in a top level function called extract_verb_features()
es: Eliminé la clase EndingCustomVectorizer y refactoré su funcionalidad en una función de nivel superior llamada extract_verb_features ()
fr: J'ai supprimé la classe EndingCustomVectorizer et refactorisé sa fonctionnalité dans une fonction de niveau supérieur appelée extract_verb_features ()
it: Ho rimosso la classe EndingCustomVectorizer e ho rifattorizzato la sua funzionalità in una funzione di livello superiore chiamata extract_verb_features ()
pt: Eu removi a classe EndingCustomVectorizer e refatorei sua funcionalidade em uma função de nível superior chamada extract_verb_features ()
ro: Am scos clasa EndingCustomVectorizer și am refactat funcționalitatea acesteia într-o funcție de nivel superior numită extract_verb_features ()

source: The provided new improved model are now being zip compressed before release because the feature space has so much grown that their size made them impractical to distribute with the package.
es: El nuevo modelo mejorado que se proporciona ahora se comprime en zip antes de su lanzamiento porque el espacio de características ha crecido tanto que su tamaño los hizo poco prácticos para distribuir con el paquete.
fr: Le nouveau modèle amélioré fourni est maintenant compressé par zip avant la publication, car la taille des modèles a tellement augmenté que leur taille les rendait peu pratiques à distribuer avec le paquet.
it: Il nuovo modello migliorato fornito viene ora compresso tramite zip prima del rilascio perché lo spazio delle funzioni è cresciuto così tanto che le loro dimensioni li hanno resi poco pratici da distribuire con il pacchetto.
pt: O novo modelo aprimorado fornecido agora está sendo compactado com zip antes do lançamento, porque o espaço do recurso cresceu tanto que seu tamanho tornou impraticável a distribuição com o pacote.
ro: Modelul îmbunătățit nou furnizat este acum comprimat cu zip înainte de lansare, deoarece spațiul caracteristicilor a crescut atât de mult încât dimensiunea acestora le-a făcut imposibil de distribuit împreună cu pachetul.

source: Renamed "Model.model" to "Model.pipeline"
es: Renombrado "Model.model" a "Model.pipeline"
fr: Renommé "Model.model" en "Model.pipeline"
it: Rinominato "Model.model" in "Model.pipeline"
pt: Renomeado "Model.model" para "Model.pipeline"
ro: Redenumit "Model.model" la "Model.pipeline"

source: Renamed "DataSet.liste_verbes" and "DataSet.liste_templates" to "DataSet.verbs_list" and "DataSet.templates_list" respectively. (Pardon my french ;-) )
es: Renombrado "DataSet.liste_verbes" y "DataSet.liste_templates" a "DataSet.verbs_list" y "DataSet.templates_list" respectivamente. (Perdón, mi francés ;-))
fr: Renommé "DataSet.liste_verbes" et "DataSet.liste_templates" à "DataSet.verbs_list" et "DataSet.templates_list" respectivement. (Excusez mon français ;-) )
it: Rinominati "DataSet.liste_verbes" e "DataSet.liste_templates" rispettivamente in "DataSet.verbs_list" e "DataSet.templates_list". (Perdona il mio francese ;-) )
pt: Renomeado "DataSet.liste_verbes" e "DataSet.liste_templates" para "DataSet.verbs_list" e "DataSet.templates_list" respectivamente. (Perdoe meu francês ;-) )
ro: Redenumit "DataSet.liste_verbes" și "DataSet.liste_templates" la "DataSet.verbs_list" și, respectiv, "DataSet.templates_list". (Scuza-mi limbajul ;-) )

source: Added the attributes "predicted" and "confidence_score" to the class Verb.
es: Se agregaron los atributos "predicha" y "confidence_score" al verbo de clase.
fr: Ajout des attributs "predicted" et "confidence_score" à la classe Verb.
it: Aggiunti gli attributi "predetto" e "confidence_score" alla classe Verb.
pt: Adicionado os atributos "previsto" e "confidence_score" para a classe Verb.
ro: A adăugat atributele "predicted" și "confidence_score" la verbul de clasă.

source: The whole package have been typed check. I will soon add mlconjug's type stubs to typeshed.
es: El paquete completo ha sido escrito a máquina. Pronto agregaré los stubs de tipo de mlconjug a la clase de mecanografía.
fr: L'ensemble du package a été annoté avec les informations sur le type de tous les objets.
it: L'intero pacchetto è stato controllato a macchina. Presto aggiungerò gli stub del tipo di mlconjug a typeshed.
pt: Todo o pacote foi digitado como cheque. Em breve, adicionarei os stubs de tipo do mlconjug ao typeshed.
ro: Întregul pachet a fost tipărit verificat. Voi adăuga în curând niște stub-uri de tip mlconjug pe care să le tipărești.

source: Updated all provided pre-trained prediction models
es: Se actualizaron todos los modelos de predicción pre-entrenados provistos
fr: Mise à jour de tous les modèles de prédiction pré-entrainés fournis
it: Aggiornato tutti i modelli di previsione pre-formati forniti
pt: Atualizado todos os modelos de previsão pré-treinados
ro: Actualizate toate modelele de predicție pre-instruire furnizate

source: The French Conjugator has accuracy of about 99.94% in predicting the correct conjugation class of a French verb. This is the baseline as i have been working on it for some time now.
es: El Conjugador francés tiene una precisión de aproximadamente 99.94% en la predicción de la clase de conjugación correcta de un verbo francés. Esta es la línea de base ya que he estado trabajando en ella desde hace un tiempo.
fr: Le Conjugueur français a une précision d'environ 99,94% dans la prédiction de la classe de conjugaison correcte d'un verbe français. C'est la base de référence car je travaille dessus depuis un certain temps maintenant.
it: Il coniugatore francese ha una precisione di circa il 99,94% nel predire la corretta classe di coniugazione di un verbo francese. Questa è la linea di base, come ho lavorato su di esso per qualche tempo.
pt: O Conjugador Francês tem precisão de cerca de 99,94% em predizer a classe de conjugação correta de um verbo francês. Esta é a linha de base, como eu tenho trabalhado nisso há algum tempo agora.
ro: Conjugatorul francez are o precizie de aproximativ 99,94% în prezicerea clasei corecte de conjugare a unui verb francez. Aceasta este linia de bază deoarece am lucrat la ea de ceva timp acum.

source: The English Conjugator has accuracy of about 99.78% in predicting the correct conjugation class of an English verb. This is one of the biggest improvement since version 2.0.0
es: El Conjugador inglés tiene una precisión de aproximadamente 99.78% en la predicción de la clase correcta de conjugación de un verbo inglés. Esta es una de las mejoras más grandes desde la versión 2.0.0
fr: Le Conjugueur anglais a une précision d'environ 99,78% dans la prédiction de la classe de conjugaison correcte d'un verbe anglais. C'est l'une des plus grandes améliorations depuis la version 2.0.0
it: Il coniugatore inglese ha una precisione di circa il 99,78% nel predire la corretta classe di coniugazione di un verbo inglese. Questo è uno dei maggiori miglioramenti dalla versione 2.0.0
pt: O Conjugador Inglês tem uma precisão de cerca de 99,78% na previsão da classe de conjugação correta de um verbo inglês. Este é um dos maiores avanços desde a versão 2.0.0
ro: Conjugatorul englez are o precizie de aproximativ 99,78% în prezicerea clasei corecte de conjugare a unui verb englez. Aceasta este una dintre cele mai mari îmbunătățiri de la versiunea 2.0.0

source: The Spanish Conjugator has accuracy of about 99.65% in predicting the correct conjugation class of a Spanish verb. It has also seen a sizable improvement since version 2.0.0
es: El Conjugador español tiene una precisión de aproximadamente 99.65% en la predicción de la clase de conjugación correcta de un verbo español. También ha visto una mejora considerable desde la versión 2.0.0
fr: Le Conjugueur espagnol a une précision d'environ 99,65% dans la prédiction de la classe de conjugaison correcte d'un verbe espagnol. Il a également vu une amélioration considérable depuis la version 2.0.0
it: Il coniugatore spagnolo ha una precisione di circa il 99,65% nel predire la corretta classe di coniugazione di un verbo spagnolo. Ha anche visto un notevole miglioramento dalla versione 2.0.0
pt: O Conjugador Espanhol tem uma precisão de cerca de 99,65% na previsão da classe de conjugação correta de um verbo espanhol. Ele também viu uma melhoria considerável desde a versão 2.0.0
ro: Conjugatorul spaniol are o precizie de aproximativ 99,65% în prezicerea clasei corecte de conjugare a unui verb spaniol. De asemenea, a înregistrat o îmbunătățire considerabilă de la versiunea 2.0.0

source: The Romanian Conjugator has accuracy of about 99.06% in predicting the correct conjugation class of a Romanian verb.This is by far the bigger gain. I modified the vectorizer to better take into account the morphological features or romanian verbs. (the previous score was about 86%, so it wil be nice for our romanian friends to have a trusted conjugator)
es: El Conjugador rumano tiene una precisión de aproximadamente 99.06% en la predicción de la clase de conjugación correcta de un verbo rumano. Esta es, de lejos, la mayor ganancia. Modifiqué el vectorizador para tener mejor en cuenta las características morfológicas o los verbos rumanos. (el puntaje anterior fue de alrededor del 86%, por lo que será bueno que nuestros amigos rumanos tengan un conjugador de confianza)
fr: Le Conjugateur roumain a une précision d'environ 99,06% pour prédire la bonne classe de conjugaison d'un verbe roumain. C'est de loin le gain le plus important. J'ai modifié le vectorizer pour mieux prendre en compte les caractéristiques morphologiques ou les verbes roumains. (Le score précédent était d'environ 86%, donc ce sera sympa pour nos amis roumains d'avoir un conjugateur de confiance)
it: Il coniugatore rumeno ha una precisione di circa il 99,06% nel predire la corretta classe di coniugazione di un verbo rumeno. Questo è di gran lunga il guadagno maggiore. Ho modificato il vettore per meglio tenere conto delle caratteristiche morfologiche o dei verbi rumeni. (il punteggio precedente era circa l'86%, quindi sarà bello per i nostri amici rumeni avere un coniuge affidabile)
pt: O Conjugador Romeno tem uma precisão de cerca de 99,06% na previsão da classe de conjugação correta de um verbo romeno. Este é de longe o maior ganho. Eu modifiquei o vetorizador para melhor levar em conta as características morfológicas ou verbos romenos. (a pontuação anterior foi de cerca de 86%, por isso será bom para os nossos amigos romenos ter um conjugador de confiança)
ro: Conjugatorul român are o precizie de aproximativ 99,06% în prezicerea clasei corecte de conjugare a unui verb românesc. Acesta este cu mult câștigul mai mare. Am modificat vectorul pentru a ține mai bine cont de caracteristicile morfologice sau de verbele românești. (scorul anterior a fost de aproximativ 86%, așa că va fi frumos pentru prietenii noștri români să aibă un conjugator de încredere)

source: The Portuguese Conjugator has accuracy of about 96.73% in predicting the correct conjugation class of a Portuguese verb.
es: El Conjugador portugués tiene una precisión de aproximadamente 96.73% en la predicción de la clase de conjugación correcta de un verbo portugués.
fr: Le Conjugueur portugais a une précision d'environ 96,73% pour prédire la bonne classe de conjugaison d'un verbe portugais.
it: Il coniugatore portoghese ha una precisione di circa il 96,73% nel predire la corretta classe di coniugazione di un verbo portoghese.
pt: O Conjugador Português tem uma precisão de cerca de 96,73% na previsão da classe correta de conjugação de um verbo português.
ro: Conjugatorul portughez are o precizie de aproximativ 96,73% în predicția clasei corecte de conjugare a unui verb portughez.

source: The Italian Conjugator has accuracy of about 94.05% in predicting the correct conjugation class of a Italian verb.
es: El Conjugador italiano tiene una precisión de aproximadamente 94.05% en la predicción de la clase de conjugación correcta de un verbo italiano.
fr: Le Conjugueur Italien a une précision d'environ 94.05% dans la prédiction de la classe de conjugaison correcte d'un verbe italien.
it: Il coniugatore italiano ha una precisione di circa il 94,05% nel predire la corretta classe di coniugazione di un verbo italiano.
pt: O Conjugador Italiano tem precisão de cerca de 94,05% em predizer a classe de conjugação correta de um verbo italiano.
ro: Conjugatorul italian are o precizie de aproximativ 94,05% în prezicerea clasei corecte de conjugare a unui verb italian.

source: Now the Conjugator adds additional information to the Verb object returned.
es: Ahora el Conjugador agrega información adicional al objeto Verb devuelto.
fr: Maintenant, le Conjugateur ajoute des informations supplémentaires à l'objet Verbe renvoyé.
it: Ora il coniugatore aggiunge ulteriori informazioni all'oggetto Verb restituito.
pt: Agora o Conjugador adiciona informações adicionais ao objeto Verbo retornado.
ro: Acum, conjugatorul adaugă informații suplimentare obiectului Verb returnat.

source: If the verb under consideration is already in Verbiste, the conjugation for the verb is retrieved directly from memory.
es: Si el verbo en cuestión ya está en Verbiste, la conjugación para el verbo se recupera directamente de la memoria.
fr: Si le verbe considéré est déjà dans Verbiste, la conjugaison pour le verbe est récupérée directement de la mémoire.
it: Se il verbo preso in considerazione è già in Verbiste, la coniugazione per il verbo viene recuperata direttamente dalla memoria.
pt: Se o verbo em consideração já está em Verbiste, a conjugação para o verbo é recuperada diretamente da memória.
ro: Dacă verbul în cauză este deja în Verbiste, conjugarea pentru verb este extrasă direct din memorie.

source: If the verb under consideration is unknown in Verbiste, the Conjugator class now sets the boolean attribute 'predicted' and the float attribute confidence score to the instance of the Verb object the Conjugator.conjugate(verb) returns.
es: Si el verbo en consideración es desconocido en Verbiste, la clase Conjugador ahora establece el atributo booleano 'predicha' y el puntaje de confianza del atributo flotante en la instancia del objeto Verb que devuelve Conjugator.conjugate (verbo).
fr: Si le verbe à l'étude est inconnu dans Verbiste, la classe Conjugator définit maintenant l'attribut booléen 'predicted' et l'attribut float 'confidence_score' à l'instance de l'objet Verb renvoyé par Conjugator.conjugate (verbe).
it: Se il verbo in considerazione è sconosciuto in Verbiste, la classe Coniugatore imposta ora l'attributo booleano 'predetto' e il punteggio di confidenza dell'attributo float sull'istanza dell'oggetto Verb che restituisce il coniugatore.conjugato (verbo).
pt: Se o verbo sob consideração é desconhecido em Verbiste, a classe Conjugador agora configura o atributo booleano 'predito' e a pontuação de confiança do atributo flutuante para a instância do objeto Verbo que o Conjugador.conjugado (verbo) retorna.
ro: Dacă verbul în cauză nu este cunoscut în Verbiste, clasa Conjugator stabilește acum atributul boolean 'predicted' și scorul de încredere a atributului float la instanța obiectului Verb conjugator.conjugate (verb) revine.

source: Added `Type annotations`_ to the whole library for robustness and ease of scaling-out.
es: Se agregó `Type annotations`_ a toda la biblioteca para mayor robustez y facilidad de escalamiento.
fr: Ajout de `Type annotations`_ à la bibliothèque entière pour garantir la robustesse du programme.
it: Aggiunte le annotazioni di tipo su tutta la libreria per robustezza e facilità di ridimensionamento.
pt: Acrescentou `Type annotations`_ a toda a biblioteca para robustez e facilidade de dimensionamento.
ro: Adăugat `Adnotări de tip` la întreaga bibliotecă pentru robustețe și ușurință de scalare.

source: The performance of the Engish and Romanian Models have improved significantly lately. I guess in a few more iteration they will be on par with the French Model which is the best performing at the moment as i have been tuning its parameters for a caouple of year now. Not so much with the other languages, but if you update regularly you will see nice improvents in the 2.2 release.
es: El rendimiento de los modelos en inglés y rumano ha mejorado significativamente últimamente. Supongo que en algunas iteraciones más estarán a la par con el modelo francés, que es el mejor en este momento, ya que he estado ajustando sus parámetros por un año. No tanto con los otros idiomas, pero si actualiza regularmente verá agradables improvisaciones en la versión 2.2.
fr: La performance des modèles anglais et roumain s'est considérablement améliorée ces derniers temps. Je suppose que dans quelques itérations, ils seront à égalité avec le modèle français qui est le plus performant en ce moment car j'ai réglé ses paramètres depuis pas mal de temps maintenant.
it: Le prestazioni dei modelli engish e rumeni sono migliorate significativamente negli ultimi tempi. Immagino che in qualche altra versione saranno alla pari con il modello francese che al momento è il migliore in quanto ho messo a punto i suoi parametri per un anno intero. Non così tanto con le altre lingue, ma se aggiorni regolarmente vedrai dei bei improvvisi nella versione 2.2.
pt: O desempenho dos modelos ingleses e romenos melhorou significativamente ultimamente. Eu acho que em mais algumas iterações eles estarão a par com o Modelo Francês que é o melhor desempenho no momento, já que eu tenho ajustado seus parâmetros para um par de anos agora. Não tanto com os outros idiomas, mas se você atualizar regularmente, verá ótimas melhorias no release 2.2.
ro: Performanțele modelelor engleze și române s-au îmbunătățit semnificativ în ultimul timp. Cred ca, in cateva iteratii, ele vor fi pe masura cu modelul francez, care este cel mai performant in momentul in care am fost tuning parametrii pentru un caouple de ani acum. Nu atât de mult cu celelalte limbi, dar dacă actualizați în mod regulat veți vedea improvizații frumos în versiunea 2.2.

source: Enhanced the localization of the program.
es: Mejorado la localización del programa.
fr: Amélioration de la localisation du programme.
it: Migliorata la localizzazione del programma.
pt: Melhorado a localização do programa.
ro: Ameliorat localizarea programului.
