Repository: SekouD/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/history.po
Languages: es, fr, it, pt, ro

source: Now the user interface of mlconjug is avalaible in French, Spanish, Italian, Portuguese and Romanian, in addition to English.
es: Ahora la interfaz de usuario de mlconjug está disponible en francés, español, italiano, portugués y rumano, además del inglés"
fr: Maintenant, l'interface utilisateur de mlconjug est disponible en français, espagnol, italien, portugais et roumain, en plus de l'anglais.
it: Ora l'interfaccia utente di mlconjug è disponibile in francese, spagnolo, italiano, portoghese e rumeno, oltre all'inglese.
pt: Agora a interface do usuário do mlconjug está disponível em francês, espanhol, italiano, português e romeno, além do inglês.
ro: Acum, interfața cu utilizatorul de mlconjug este disponibilă în engleză, franceză, spaniolă, italiană, portugheză și română.

source: `All the documentation of the project`_ have been translated in the supported languages.
es: `Toda la documentación del proyecto`_ ha sido traducida a los idiomas admitidos.
fr: `Toute la documentation du projet`_ a été traduite dans les langues supportées.
it: `Tutta la documentazione del progetto`_ è stata tradotta nelle lingue supportate.
pt: `Toda a documentação do projeto`_ foi traduzida nos idiomas suportados.
ro: "Toate documentațiile proiectului" au fost traduse în limbile acceptate.

source: Added localization.
es: Localización agregada"
fr: Localisation ajoutée.
it: Aggiunta localizzazione.
pt: Adicionado localização.
ro: Localizare adăugată.

source: Added invalid verb detection.
es: Se agregó detección de verbos inválidos"
fr: Ajout de la détection des verbes invalides.
it: Aggiunto riconoscimento verbo non valido.
pt: Adicionada detecção de verbo inválida.
ro: A fost adăugată detectarea verbelor invalide.

source: Updated all language models for compatibility with scikit-learn 0.19.1.
es: Actualicé todos los modelos de idiomas para compatibilidad con scikit-learn 0.19.1"
fr: Mise à jour de tous les modèles d'apprentissage de langue pour compatibilité avec scikit-learn 0.19.1.
it: Aggiornamento di tutti i modelli linguistici per compatibilità con scikit-learn 0.19.1.
pt: Atualizados todos os modelos de linguagem para compatibilidade com o scikit-learn 0.19.1.
ro: Actualizat toate modelele de limbă pentru compatibilitatea cu scikit-learn 0.19.1.

source: Includes English conjugation model.
es: Incluye el modelo de conjugación en inglés"
fr: Inclut le modèle de conjugaison anglais.
it: Include il modello di coniugazione inglese.
pt: Inclui modelo de conjugação em inglês.
ro: Include modelul de conjugare în limba engleză.

source: Includes Spanish conjugation model.
es: Incluye el modelo de conjugación español"
fr: Inclut le modèle de conjugaison espagnol.
it: Include il modello di coniugazione spagnolo.
pt: Inclui o modelo de conjugação em espanhol.
ro: Include modelul de conjugare spaniol.

source: Includes Italian conjugation model.
es: Incluye el modelo de conjugación italiano"
fr: Inclut le modèle de conjugaison italien.
it: Include il modello di coniugazione italiano.
pt: Inclui o modelo de conjugação italiano.
ro: Include modelul de conjugare italian"

source: Includes Portuguese conjugation model.
es: Incluye el modelo de conjugación portugués"
fr: Inclut le modèle de conjugaison portugais.
it: Include il modello di coniugazione portoghese.
pt: Inclui o modelo de conjugação em português.
ro: Include modelul de conjugare portugheză.

source: Includes Romanian conjugation model.
es: Incluye el modelo de conjugación rumano"
fr: Inclut le modèle de conjugaison roumain.
it: Include il modello di coniugazione rumeno.
pt: Inclui o modelo de conjugação romena.
ro: Include modelul de conjugare din România"

source: Refactored the API. Now a Single class Conjugator is needed to interface with the module.
es: Refactorizó la API. Ahora se necesita un Conjugador de una sola clase para interactuar con el módulo"
fr: Refactorisé l'API, une classe unique Conjugateur est maintenant suffisante pour l'interface avec le module.
it: Rifattorizzato l'API. Ora è necessario un coniugatore di classe singola per interfacciarsi con il modulo.
pt: Refatorou a API. Agora, é necessário um Conjugador de classe única para interagir com o módulo.
ro: A fost refactat API-ul. Acum este nevoie de un singur conjugator de clasă pentru a interfața cu modulul.

source: Includes improved french conjugation model.
es: Incluye un modelo mejorado de conjugación en francés"
fr: Inclut un modèle de conjugaison du français amélioré.
it: Include un modello di coniugazione francese migliorato.
pt: Inclui melhor modelo de conjugação francesa.
ro: Include un model de conjugare francez îmbunătățit"

source: Added support for multiple languages.
es: Se agregó soporte para múltiples idiomas"
fr: Ajout du support pour plusieurs langues.
it: Aggiunto supporto per più lingue.
pt: Adicionado suporte para vários idiomas.
ro: Suport adăugat pentru mai multe limbi.

source: First release on PyPI.
es: Primer lanzamiento en PyPI"
fr: Première version sur PyPI.
it: Prima versione su PyPI.
pt: Primeiro lançamento no PyPI.
ro: Prima versiune pe PyPI"
