Repository: SekouD/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: it, pt, ro

source: Installation
it: Installazione
pt: Instalação
ro: Instalare

source: Stable release
it: Rilascio stabile
pt: Versão estável
ro: Versiune stabila

source: To install MLConjug, run this command in your terminal:
it: Per installare MLConjug, esegui questo comando nel tuo terminale:
pt: Para instalar o MLConjug, execute este comando no seu terminal:
ro: Pentru a instala MLConjug, executați această comandă în terminalul dvs.:

source: This is the preferred method to install MLConjug, as it will always install the most recent stable release.
it: Questo è il metodo preferito per installare MLConjug, poiché installerà sempre la versione stabile più recente.
pt: Este é o método preferido para instalar o MLConjug, já que ele sempre instalará a versão estável mais recente.
ro: Aceasta este metoda preferată de a instala MLConjug, deoarece va instala întotdeauna cea mai recentă versiune stabilă.

source: If you don't have `pip`_ installed, this `Python installation guide`_ can guide you through the process.
it: Se non hai installato` pip`_, questa `Guida all'installazione di Python`_ può guidarti attraverso il processo.
pt: Se você não tem o` pip`_ instalado, este `guia de instalação do Python`_ pode guiá-lo através do processo.
ro: Dacă nu aveți instalat" pip ", acest" ghid de instalare Python "vă poate ghida prin acest proces.

source: From sources
it: Dalle fonti
pt: De fontes
ro: Din surse

source: The sources for MLConjug can be downloaded from the `Github repo`_.
it: Le fonti per MLConjug possono essere scaricate dal` Github repo`_.
pt: As fontes do MLConjug podem ser baixadas do repositório do Github.
ro: Sursele pentru MLConjug pot fi descărcate din" Github repo ".

source: You can either clone the public repository:
it: Puoi clonare il repository pubblico:
pt: Você pode clonar o repositório público:
ro: Puteți fie să clonați depozitul public:

source: Or download the `tarball`_:
it: Oppure scarica il` tarball`_:
pt: Ou baixe o` tarball`_:
ro: Sau descarca" tarball "_:

source: Once you have a copy of the source, you can install it with:
it: Una volta che hai una copia del codice sorgente, puoi installarlo con:
pt: Depois de ter uma cópia da fonte, você pode instalá-lo com:
ro: Odată ce aveți o copie a sursei, o puteți instala cu:
