Repository: SekouD/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: fr

source: Package Api Documentation for mlconjug
fr: Documentation de l'Api mlconjug

source: API Reference for the classes in mlconjug.mlconjug.py
fr: Référence de l'API pour les classes dans mlconjug.mlconjug.py

source: MLConjug Main module.
fr: Module principal de MLConjug .

source: This module declares the main classes the user interacts with.
fr: Ce module déclare les classes principales avec lesquelles l'utilisateur interagit.

source: The module defines the classes needed to interface with Machine Learning models.
fr: Le module définit les classes nécessaires à l'interface avec les modèles de Machine Learning.

source: Custom Vectorizer optimized for extracting verbs features.
fr: Vectorizer optimisé pour extraire les fonctionnalités des verbes.

source: The Vectorizer subclasses sklearn.feature_extraction.text.CountVectorizer .
fr: Le Vectorizer hérite de la classe sklearn.feature_extraction.text.CountVectorizer.

source: As in Indo-European languages verbs are inflected by adding a morphological suffix, the vectorizer extracts verb endings and produces a vector representation of the verb with binary features.
fr: Comme dans les langues indo-européennes les verbes sont infléchis en ajoutant un suffixe morphologique, le vectorizer extrait les terminaisons verbales et d'autres traits caractéristiques et produit une représentation vectorielle du verbe avec des caractéristiques binaires.

source: To enhance the results of the feature extration, several other features have been included:
fr: Pour améliorer les résultats de l'extraction de caractéristiques, plusieurs autres fonctionnalités ont été incluses:

source: The features are the verb's ending n-grams, starting n-grams, length of the verb, number of vowels, number of consonants and the ratio of vowels over consonants.
fr: Les caractéristiques sont la fin du verbe n-grammes, départ n-grammes, la longueur du verbe, le nombre de voyelles, le nombre de consonnes et le rapport des voyelles sur les consonnes.

source: Parameters
fr: Paramètres

source: string. Verb to vectorize.
fr: string. Verbe à vectoriser.

source: string. Language to analyze.
fr: string. Langue à analyser.

source: tuple. The range of the ngram sliding window.
fr: tuple. La taille de la fenêtre de n-grams.

source: list. List of the most salient features of the verb for the task of finding it's conjugation's class.
fr: list. Liste des caractéristiques les plus saillantes du verbe pour la tâche de trouver sa classe de conjugaison.

source: This is the main class of the project.
fr: C'est la classe principale du projet.

source: The class manages the Verbiste data set and provides an interface with the scikit-learn pipeline.
fr: La classe gère la base de données de Verbiste et fournit une interface avec le modèle scikit-learn.

source: If no parameters are provided, the default language is set to french and the pre-trained french conjugation pipeline is used.
fr: Si aucun paramètre n'est fourni, la langue par défaut est le français et le modèle de conjugaison pré-entraîné du français est utilisé.

source: The class defines the method conjugate(verb, language) which is the main method of the module.
fr: La classe définit la méthode conjugate(verbe, langue) qui est la méthode principale du module.

source: string. Language of the conjugator. The default language is 'fr' for french.
fr: string. Langue du conjugateur. La langue par défaut est 'fr' pour le français.

source: mlconjug.Model or scikit-learn Pipeline or Classifier implementing the fit() and predict() methods. A user provided pipeline if the user has trained his own pipeline.
fr: mlconjug.Model ou scikit-learn Pipeline ou Classifier implémentant les méthodes fit () et predict (). Un pipeline fourni par l'utilisateur si l'utilisateur a formé son propre pipeline.

source: This is the main method of this class.
fr: C'est la méthode principale de cette classe.

source: It first checks to see if the verb is in Verbiste.
fr: La méthode vérifie d'abord si le verbe est dans Verbiste.

source: If it is not, and a pre-trained scikit-learn pipeline has been supplied, the method then calls the pipeline to predict the conjugation class of the provided verb.
fr: Si ce n'est pas le cas, et qu'un modèle d'apprentissage de scikit-learn pré-entraîné a été fourni, la méthode appelle alors le modèle

source: Returns a Verb object or None.
fr: Renvoie un objet Verb ou None.

source: string. Verb to conjugate.
fr: string. Verbe à conjuguer.

source: string. Toggles abbreviated or full pronouns. The default value is 'abbrev'. Select 'pronoun' for full pronouns.
fr: string. Active les pronoms abrégés ou entiers. La valeur par défaut est 'abbrev' Sélectionnez 'pronoun' pour les pronoms complets.

source: Verb object or None.
fr: Objet Verb ou None.

source: Assigns the provided pre-trained scikit-learn pipeline to be able to conjugate unknown verbs.
fr: Assigne le modèle scikit-learn pré-entraîné fourni afin de conjuguer les verbes inconnus.

source: scikit-learn Classifier or Pipeline.
fr: Classificateur ou Pipeline scikit-learn.

source: This class holds and manages the data set.
fr: Cette classe contient et gère l'ensemble de données nécessaires à l'entrainement du modèle d'apprentissage.

source: Defines helper methodss for managing Machine Learning tasks like constructing a training and testing set.
fr: Définit les fonctions d'assistance pour la gestion des tâches d'apprentissage automatique, telles que la construction d'un ensemble d'entraînement et de test.

source: A dictionary of verbs and their corresponding conjugation class.
fr: Un dictionnaire de verbes et leur classe de conjugaison correspondante.

source: Populates the dictionary containing the conjugation templates.
fr: Remplit le dictionnaire contenant les classes de conjugaison.

source: Populates the lists containing the verbs and their templates.
fr: Remplit les listes contenant les verbes et leurs classes.

source: Splits the data into a training and a testing set.
fr: Divise les données en un ensemble d'entrainement et un ensemble de test.

source: int. Minimum size of conjugation class to be split.
fr: int. Taille minimale de la classe de conjugaison à diviser.

source: float. Proportion of samples in the training set. Must be between 0 and 1.
fr: float. Proportion d'échantillons dans l'ensemble d'entraînement. Doit être compris entre 0 et 1.

source: This class manages the scikit-learn pipeline.
fr: Cette classe gère le modèle scikit-learn.

source: The Pipeline includes a feature vectorizer, a feature selector and a classifier.
fr: Le Pipeline comprend un vectoriseur de caractéristiques, un sélecteur de caractéristiques et un classificateur.

source: If any of the vectorizer, feature selector or classifier is not supplied at instance declaration, the __init__ method will provide good default values that get more than 92% prediction accuracy.
fr: la méthode __init__ fournira des valeurs par défaut acceptables qui obtiennent plus de 92% de précision de prédiction en moyenne selon les langues.

source: scikit-learn Classifier with a fit_transform() method
fr: scikit-learn Classifier avec une méthode fit_transform ()

source: scikit-learn Classifier with a predict() method
fr: scikit-learn Classifier avec une méthode predict ()

source: language of the corpus of verbs to be analyzed.
fr: langue du corpus de verbes à analyser.

source: Trains the pipeline on the supplied samples and labels.
fr: Entraîne le modèle sur les échantillons et les labels fournis.

source: list. List of verbs.
fr: list. Liste de verbes.

source: list. List of verb templates.
fr: list. Liste de classes de cojugaison de verbes.

source: Predicts the conjugation class of the provided list of verbs.
fr: Prédit la classe de conjugaison de la liste de verbes fournie.

source: list. List of predicted conjugation groups.
fr: list. Liste des classes de conjugaison prédites.

source: API Reference for the classes in mlconjug.PyVerbiste.py
fr: Référence de l'API pour les classes dans mlconjug.PyVerbiste.py

source: A Python library for conjugating verbs in French, English, Spanish, Italian, Portuguese and Romanian (more soon).
fr: Une bibliothèque Python pour conjuguer les verbes en français, anglais, espagnol, italien, portugais et roumain (et plus bientôt!).

source: It contains conjugation data generated by machine learning models using the python library mlconjug.
fr: La librarie contient des données de conjugaison générées par des modèles d'apprentissage automatique utilisant la bibliothèque Python mlconjug.

source: More information about mlconjug at https://pypi.org/project/mlconjug/
fr: Plus d'informations sur mlconjug sur https://pypi.org/project/mlconjug/

source: The conjugation data conforms to the XML schema defined by Verbiste.
fr: Les données de conjugaison sont conformes au schéma XML défini par Verbiste.

source: More information on Verbiste at https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html
fr: Plus d'informations sur Verbiste à https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html

source: This is the class handling the mlconjug json files.
fr: C'est la classe qui manipule et sert d'interface avec les fichiers json.

source: string. | The language of the conjugator. The default value is fr for French. | The allowed values are: fr, en, es, it, pt, ro.
fr: string. | Langue du conjugateur. La langue par défaut est 'fr' pour le français.

source: Load and parses the verbs from the json file.
fr: Charge et analyse les verbes du fichier json.

source: string or path object. Path to the verbs json file.
fr: string ou Path object. Chemin d'accès au fichier json des verbes.

source: Load and parses the conjugations from the xml file.
fr: Charge et analyse les conjugaisons à partir du fichier json.

source: string or path object. Path to the conjugation xml file.
fr: string ou objet Path. Chemin d'accès au fichier xml de conjugaison.

source: Detects the allowed endings for verbs in the supported languages.
fr: Détecte les terminaisons autorisées des verbes dans les langues prises en charge.

source: All the supported languages except for English restrict the form a verb can take.
fr: Toutes les langues prises en charge à l'exception de l'anglais limitent la forme qu'un verbe peut prendre.

source: As English is much more productive and varied in the morphology of its verbs, any word is allowed as a verb.
fr: Comme l'anglais est beaucoup plus productif et varié dans la morphologie de ses verbes, n'importe quel mot est autorisé comme un verbe.

source: set. A set containing the allowed endings of verbs in the target language.
fr: set. Un ensemble contenant les terminaisons autorisées des verbes dans la langue cible.

source: Checks if the verb is a valid verb in the given language.
fr: Vérifie si le verbe est un verbe valide dans la langue cible.

source: English words are always treated as possible verbs.
fr: Les mots anglais sont toujours traités comme des verbes possibles.

source: Verbs in other languages are filtered by their endings.
fr: Les verbes dans les autres langues sont filtrés par leurs terminaisons.

source: string. The verb to conjugate.
fr: string. Le verbe à conjuguer.

source: bool. True if the verb is a valid verb in the language. False otherwise.
fr: bool. True si le verbe est un verbe valide dans la langue. False sinon.

source: Gets verb information and returns a VerbInfo instance.
fr: Récupère les informations du verbe et renvoie une instance de VerbInfo.

source: VerbInfo object or None.
fr: Objet VerbInfo ou None.

source: Gets conjugation information corresponding to the given template.
fr: Récupère les informations de conjugaison correspondant à la classe de conjugaison donné.

source: string. Name of the verb ending pattern.
fr: string. Nom de la classe de conjugaison du verbe.

source: OrderedDict or None. OrderedDict containing the conjugated suffixes of the template.
fr: OrderedDict ou None. OrderedDict contenant les suffixes conjugués de la classe de conjugaison.

source: This is the class handling the Verbiste xml files.
fr: C'est la classe qui manipule et sert d'interface avec les fichiers xml de Verbiste.

source: Load and parses the verbs from the xml file.
fr: Charge et analyse les verbes du fichier XML.

source: string or path object. Path to the verbs xml file.
fr: string ou Path object. Chemin d'accès au fichier xml des verbes.

source: Parses the XML file.
fr: Analyse le fichier XML.

source: FileObject. XML file containing the verbs.
fr: FileObject. Fichier XML contenant les verbes.

source: OrderedDict. An OrderedDict containing the verb and its template for all verbs in the file.
fr: OrderedDict. Un OrderedDict contenant le verbe et sa classe de conjugaison pour tous les verbes dans le fichier.

source: FileObject. XML file containing the conjugation templates.
fr: FileObject. Fichier XML contenant les classes de conjugaison.

source: OrderedDict. An OrderedDict containing all the conjugation templates in the file.
fr: OrderedDict. Un OrderedDict contenant toutes les classes de conjugaison dans le fichier.

source: Load and parses the inflected forms of the tense from xml file.
fr: Charge et analyse les formes fléchies du temps à partir du fichier xml.

source: list of xml tags containing inflected forms. The list of inflected forms for the current tense being processed.
fr: liste des balises xml contenant des formes fléchies. La liste des formes fléchies pour le temps courant en cours de traitement.

source: list. List of inflected forms.
fr: list. Liste de formes conjuguées.

source: This class defines the Verbiste verb information structure.
fr: Cette classe définit la structure d'information du verbe Verbiste.

source: string. Infinitive form of the verb.
fr: string. Forme infinitive du verbe.

source: string. Lexical root of the verb.
fr: string. Racine lexicale du verbe.

source: This class defines the Verb Object.
fr: Cette classe définit l'objet Verb.

source: VerbInfo Object.
fr: Objet VerbInfo.

source: bool. Indicates if the conjugation information was predicted by the model or retrieved from the dataset.
fr: bool. Indique si les informations de conjugaison ont été prédites par le modèle ou extraites de l'ensemble de données.

source: Populates the inflected forms of the verb.
fr: Remplit les formes fléchies du verbe.

source: This is the generic version of this method.
fr: Ceci est la version générique de cette méthode.

source: It does not add personal pronouns to the conjugated forms.
fr: Cette version n'ajoute pas de pronoms personnels aux formes conjuguées.

source: This method can handle any new language if the conjugation structure conforms to the Verbiste XML Schema.
fr: Cette méthode peut gérer n'importe quel nouvelle langue si la structure de conjugaison est conforme au schéma XML de Verbiste.

source: This class defines the French Verb Object.
fr: Cette classe définit l'objet Verb français.

source: Adds personal pronouns to the inflected verbs.
fr: Ajoute les pronoms personnels aux verbes fléchis.

source: This class defines the English Verb Object.
fr: Cette classe définit l'objet de Verb anglais.

source: This class defines the Spanish Verb Object.
fr: Cette classe définit l'objet Verb espagnol.

source: This class defines the Italian Verb Object.
fr: Cette classe définit l'objet Verb italien.

source: This class defines the Portuguese Verb Object.
fr: Cette classe définit l'objet Verb portugais.

source: This class defines the Romanian Verb Object.
fr: Cette classe définit l'objet Verb roumain.
