Repository: SekouD/mlconjug
Catalog: docs/locale/*/LC_MESSAGES/readme.po
Languages: es, fr, it, pt, ro

source: A Python library to conjugate verbs in French, English, Spanish, Italian, Portuguese and Romanian (more soon) using Machine Learning techniques.
es: Una biblioteca de Python para conjugar verbos en francés, inglés, español, italiano, portugués y rumano (más pronto) usando técnicas de Machine Learning.
fr: Une librairie Python pour conjuguer les verbes en français, anglais, espagnol, italien, portugais et roumain (plus bientôt) en utilisant des techniques d'apprentissage automatique autrement appelées Machine Learning.
it: Una libreria Python per coniugare verbi in francese, inglese, spagnolo, italiano, portoghese e rumeno (più presto) usando tecniche di Machine Learning.
pt: Uma biblioteca Python para conjugar verbos em francês, inglês, espanhol, italiano, português e romeno (mais em breve) usando técnicas de Machine Learning.
ro: O bibliotecă Python care conjugă verbe în franceză, engleză, spaniolă, italiană, portugheză și română (mai curând) folosind tehnici de învățare a mașinilor"

source: Any verb in one of the supported language can be conjugated, as the module contains a Machine Learning model of how the verbs behave.
es: Cualquier verbo en uno de los idiomas soportados puede ser conjugado, ya que el módulo contiene un modelo de Aprendizaje automático sobre cómo se comportan los verbos.
fr: N'importe quel verbe dans l'une des langues prises en charge peut être conjugué, car le module contient un modèle d'apprentissage automatique du comportement des verbes.
it: Qualsiasi verbo in una delle lingue supportate può essere coniugato, in quanto il modulo contiene un modello di Machine Learning su come si comportano i verbi.
pt: Qualquer verbo em uma das linguagens suportadas pode ser conjugado, já que o módulo contém um modelo de Aprendizado de Máquina de como os verbos se comportam.
ro: Orice verb într-unul din limbile acceptate poate fi conjugat, deoarece modulul conține un model de învățare a mașinilor despre cum se comportă verbul"

source: Even completely new or made-up verbs can be successfully conjugated in this manner.
es: Incluso los verbos completamente nuevos o inventados pueden conjugarse exitosamente de esta manera.
fr: Même des verbes complètement nouveaux ou inventés peuvent être conjugués avec succès de cette manière.
it: Anche verbi completamente nuovi o inventati possono essere coniugati con successo in questo modo.
pt: Mesmo verbos completamente novos ou inventados podem ser conjugados com sucesso desta maneira.
ro: Chiar și verbele complet noi sau confecționate pot fi conjugate cu succes în acest fel"

source: The supplied pre-trained models are composed of:
es: Los modelos preentrenados suministrados se componen de:
fr: Les modèles pré-entraînés fournis sont composés de:
it: I modelli pre-formati forniti sono composti da:
pt: Os modelos pré-treinados fornecidos são compostos por:
ro: Modelele pre-instruite furnizate sunt compuse din:

source: a binary feature extractor,
es: un extractor de funciones binarias,
fr: un extracteur de traits binaire (caractéristiques saillantes des verbes),
it: un estrattore di feature binario
pt: um extrator de recurso binário
ro: un extractor de caracteristici binare

source: a feature selector using Linear Support Vector Classification,
es: un selector de funciones usando Linear Support Vector Classification,
fr: un sélecteur de caractéristiques utilisant la classification linéaire vectorisée de support (Linear Support Vector Classification),
it: un selettore di funzionalità che utilizza la classificazione vettoriale di supporto lineare
pt: um seletor de recursos usando a Classificação Linear de Vetor de Suporte
ro: un selector de elemente care utilizează clasificarea vectorială de sprijin liniar,

source: a classifier using Stochastic Gradient Descent.
es: un clasificador que usa el Gradiente de Gradiente Estocástico.
fr: un classificateur utilisant la descente de gradient stochastique (Stochastic Gradient Descent).
it: un classificatore che utilizza la discesa gradiente stocastica"
pt: um classificador usando o descendente de gradiente estocástico"
ro: un clasificator care utilizează coborârea stochastică.

source: MLConjug uses scikit-learn to implement the Machine Learning algorithms.
es: MLConjug usa scikit-learn para implementar los algoritmos de Machine Learning.
fr: MLConjug utilise scikit-learn pour implémenter les algorithmes de Machine Learning.
it: MLConjug usa scikit-imparare per implementare gli algoritmi di Machine Learning.
pt: O MLConjug usa o scikit-learn para implementar os algoritmos de Machine Learning.
ro: MLConjug utilizează scikit-learn pentru a implementa algoritmii Machine Learning.

source: Users of the library can use any compatible classifiers from scikit-learn to modify and retrain the models.
es: Los usuarios de la biblioteca pueden usar cualquier clasificador compatible de scikit-learn para modificar y volver a entrenar el modelo.
fr: Les utilisateurs de la librairie peuvent utiliser n'importe quel classificateur compatible avec l'API scikit-learn pour modifier et entraîner le modèle.

source: The training data for the french model is based on Verbiste https://perso.b2b2c.ca/~sarrazip/dev/verbiste.html .
es: Los datos de capacitación se basan en Verbiste https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html.
fr: Les données d'entraînement pour le français sont basées sur Verbiste https://perso.b2b2c.ca/~sarrazip/dev/conjug_manager.html.

source: The training data for English, Spanish, Italian, Portuguese and Romanian was generated using unsupervised learning techniques using the French model as a model to query during the training.
es: Los datos de entrenamiento para inglés, español, italiano, portugués y rumano se generaron utilizando técnicas de aprendizaje no supervisadas utilizando el modelo francés como modelo para consultar durante el entrenamiento.
fr: Les données d'apprentissage pour l'anglais, l'espagnol, l'italien, le portugais et le roumain ont été générées en utilisant des techniques d'apprentissage non supervisées en utilisant le modèle français comme modèle à interroger pendant la formation.
it: I dati di addestramento per inglese, spagnolo, italiano, portoghese e rumeno sono stati generati utilizzando tecniche di apprendimento senza supervisione utilizzando il modello francese come modello da interrogare durante la formazione.
pt: Os dados de treinamento para inglês, espanhol, italiano, português e romeno foram gerados usando técnicas de aprendizado não supervisionadas usando o modelo francês como modelo para consulta durante o treinamento.
ro: Datele de antrenament pentru limbile engleză, spaniolă, italiană, portugheză și română au fost generate folosind tehnici de învățare nesupravegheate, utilizând modelul francez, ca model de interogare în timpul antrenamentului.

source: Free software: MIT license
es: Software libre: licencia MIT
fr: Logiciel libre: licence MIT
it: Software gratuito: licenza MIT
pt: Software livre: licença do MIT
ro: Software-ul gratuit: licență MIT

source: Documentation: https://mlconjug.readthedocs.io.
es: Documentación: https://mlconjug.readthedocs.io
it: Documentazione: https://mlconjug.readthedocs.io.
pt: Documentação: https://mlconjug.readthedocs.io.
ro: Documentație: https://mlconjug.readthedocs.io.

source: Supported Languages
es: Idiomas admitidos
fr: Langues prises en charge
it: Lingue supportate
pt: Idiomas Suportados
ro: Limbi acceptate

source: French
es: Francés
fr: Français
it: Francese
pt: Francês
ro: Limba franceza

source: English
es: Inglés
fr: Anglais
it: Inglese
pt: Inglês
ro: Engleză

source: Spanish
es: Español
fr: Espagnol
it: Spagnolo
pt: Espanhol
ro: Spaniolă

source: Italian
es: Italiano
fr: Italien
it: Italiano
pt: Italiano
ro: Italiană

source: Portuguese
es: Portugués
fr: Portugais
it: Portoghese
pt: Português
ro: Portugheză

source: Romanian
es: Rumano
fr: Roumain
it: Rumeno
pt: Romena
ro: Română

source: Features
es: Caracteristicas
fr: Fonctionnalités
it: Caratteristiche
pt: Características
ro: Caracteristici

source: Easy to use API.
es: API fácil de usar.
fr: API facile à utiliser.
it: API facile da usare"
pt: Fácil de usar API"
ro: PI ușor de utilizat

source: Includes pre-trained models with 99% + accuracy in predicting conjugation class of unknown verbs.
es: Incluye modelos pre-entrenados con un 99% de precisión en la predicción de la conjugación de verbos desconocidos.
fr: Inclut des modèles pré-entraînés avec une précision de plus de 99% dans la prédiction de la classe de conjugaison des verbes inconnus.
it: Include modelli pre-addestrati con un'accuratezza del 99% + nel predire la classe di coniugazione di verbi sconosciuti.
pt: Inclui modelos pré-treinados com precisão de 99% + na previsão de classe de conjugação de verbos desconhecidos.
ro: Include modele pre-instruite cu o acuratețe de 99% + în prezicerea clasei de conjugare a verbelor necunoscute.

source: Easily train new models or add new languages.
es: Entrene fácilmente nuevos modelos o agregue nuevos idiomas.
fr: Entraînez facilement de nouveaux modèles d'apprentissage automatique ou ajoutez de nouvelles langues.
it: Allena facilmente nuovi modelli o aggiungi nuove lingue.
pt: Treine facilmente novos modelos ou adicione novos idiomas.
ro: Formați cu ușurință modele noi sau adăugați limbi noi.

source: Easily integrate MLConjug in your own projects.
es: Integre fácilmente MLConjug en sus propios proyectos.
fr: Intégrez facilement MLConjug dans vos propres projets.
it: Integrate facilmente MLConjug nei vostri progetti.
pt: Integre facilmente o MLConjug em seus próprios projetos.
ro: Integrați cu ușurință programul MLConjug în propriile proiecte.

source: Can be used as a command line tool.
es: Se puede usar como una herramienta de línea de commandos.
fr: Peut être utilisé comme un outil de ligne de commande.
it: Può essere usato come uno strumento da riga di comando.
pt: Pode ser usado como uma ferramenta de linha de comando.
ro: Poate fi folosit ca un instrument de linie de comandă.

source: Credits
es: Créditos
fr: Crédits
it: Crediti
pt: Créditos
ro: Credite

source: This package was created with the help of Verbiste_ and scikit-learn_.
es: Este paquete fue creado con la ayuda de Verbiste_ y scikit-learn_.
fr: Ce logiciel a été créé avec l'aide de Verbiste_ et de scikit-learn_.
it: Questo pacchetto è stato creato con l'aiuto di Verbiste_ e scikit-learn_.
pt: Este pacote foi criado com a ajuda de Verbiste_ e scikit-learn_.
ro: Acest pachet a fost creat cu ajutorul Verbiste_ și scikit-learn_"

source: The logo was designed by Zuur_.
es: El logo fue diseñado por Zuur_.
fr: Le logo a été conçu par Zuur_.
it: Il logo è stato progettato da Zuur_.
pt: O logotipo foi projetado por Zuur_.
ro: Sigla a fost creată de Zuur_.
