Repository: SekouD/mlconjug
Catalog: mlconjug/locale/*/LC_MESSAGES/mlconjug.po
Languages: es, fr, it, pt, ro

source: | This is the main class of the project. | The class manages the Verbiste data set and provides an interface with the scikit-learn model. | If no parameters are provided, the default language is set to french and the pre-trained french conjugation model is used. | The class defines the method conjugate(verb, language) which is the main method of the module. :param language: string. Language of the conjugator. The default language is 'fr' for french. :param model: string. A user provided model if the user has trained his own model.
es: | Esta es la clase principal del proyecto. | La clase administra el conjunto de datos Verbiste y proporciona una interfaz con el modelo scikit-learn. | Si no se proporcionan parámetros, el idioma predeterminado se establece en francés y se utiliza el modelo de conjugación francés preentrenado. | La clase define el método conjugado (verbo, lenguaje) que es el método principal del módulo. :param language: string. Idioma del conjugador El idioma predeterminado es 'fr' para francés. :param model: string. Un modelo proporcionado por el usuario si el usuario ha entrenado su propio modelo.
fr: | Ceci est la classe principale du projet. | La classe gère la base de données Verbiste et fournit une interface avec le modèle scikit-learn. | Si aucun paramètre n'est fourni, la langue par défaut est le français et le modèle de conjugaison français pré-entraîné est utilisé. | La classe définit la méthode conjugate(verbe, langue) qui est la méthode principale du module. :param language: string. Langue du conjugateur. La langue par défaut est 'fr' pour le français. :param model: string. Un modèle fourni par l'utilisateur si l'utilisateur a formé son propre modèle.
it: | Questa è la classe principale del progetto. | La classe gestisce il set di dati Verbiste e fornisce un'interfaccia con il modello di apprendimento scikit. | Se non vengono forniti parametri, la lingua predefinita è impostata su francese e viene utilizzato il modello di coniugazione francese pre-addestrato. | La classe definisce il metodo conjugate (verb, language) che è il metodo principale del modulo. :param language: string. Lingua del coniugatore. La lingua predefinita è "fr" per il francese. :param model: string. Un modello fornito dall'utente se l'utente ha formato il proprio modello.
pt: | Esta é a classe principal do projeto. | A classe gerencia o conjunto de dados Verbiste e fornece uma interface com o modelo scikit-learn. | Se nenhum parâmetro for fornecido, o idioma padrão é definido para francês e o modelo de conjugação francês pré-treinado é usado. | A classe define o método conjugado (verbo, idioma) que é o método principal do módulo. :param language: string. Linguagem do conjugador. O idioma padrão é 'fr' para francês. :param model: string. Um modelo fornecido pelo usuário se o usuário tiver treinado seu próprio modelo.
ro: | Aceasta este clasa principală a proiectului. | Clasa gestionează setul de date Verbiste și oferă o interfață cu modelul scikit-learn. | Dacă nu sunt furnizați parametri, limba implicită este setată la limba franceză și se folosește modelul de conjugare franceză pre-instruit. | Clasa definește metoda conjugate (verb, limbă) care este principala metodă a modulului. :param language: string. Limba conjugatorului. Limba implicită este "fr" pentru franceză. :param model: string. Model furnizat de utilizator dacă utilizatorul și-a pregătit propriul model.

source: | This is the main method of this class. | It first checks to see if the verb is in Verbiste. | If it is not, and a pre-trained scikit-learn model has been supplied, the method then calls the model to predict the conjugation class of the provided verb. | Returns a Verb object or None. :param verb: string. Verb to conjugate. :param subject: string. Toggles abbreviated or full pronouns. The default value is 'abbrev'. Select 'pronoun' for full pronouns. :return: Verb object or None.
es: | Este es el método principal de esta clase. | Primero verifica si el verbo está en Verbiste. | Si no es así, y se ha proporcionado un modelo de aprendizaje scikit preentrenado, el método llama al modelo para predecir la clase de conjugación del verbo proporcionado. | Devuelve un objeto Verb o None. :param verb: string. Verbo para conjugar :param subject: string. Alterna los pronombres abreviados o completos. El valor predeterminado es 'abreviatura'. Seleccione 'pronombre' para los pronombres completos. :return: Verb object or None.
fr: | C'est la méthode principale de cette classe. | La méthode vérifie d'abord si le verbe est dans Verbiste. | Si ce n'est pas le cas, et qu'un modèle scikit-learn pré-entrainé a été fourni, la méthode appelle alors le modèle pour prédire la classe de conjugaison du verbe fourni. | Retourne un objet Verbe ou None. :param verb: string. Verbe pour conjuguer. :param subject: string. Selectionne les pronoms abrégés ou complets. La valeur par défaut est 'abbrev'. Sélectionnez "pronom" pour les pronoms complets. :return: Verb object or None.
it: | Questo è il metodo principale di questa classe. | Prima controlla se il verbo è in Verbiste. | In caso contrario, è stato fornito un modello di apprendimento scikit pre-addestrato, quindi il metodo chiama il modello per predire la classe di coniugazione del verbo fornito. | Restituisce un oggetto Verb o None. :param verb: string. Verbo da coniugare. :param subject: string. Attiva i pronomi abbreviati o pieni. Il valore predefinito è 'abbrev'. Seleziona "pronome" per i pronomi completi. :return: Verb object or None.
pt: | Este é o método principal desta classe. | Primeiro, verifica se o verbo está em Verbiste. | Se não for, e um modelo de scikit-learn pré-treinado foi fornecido, o método chama o modelo para prever a classe de conjugação do verbo fornecido. | Retorna um objeto Verb ou None. :param verb: string. Verbo para conjugar. :param subject: string. Ativa os pronomes abreviados ou completos. O valor padrão é 'abrev'. Selecione 'pronome' para pronomes completos. :return: Verb object or None.
ro: | Aceasta este principala metodă a acestei clase. | Mai întâi verifică dacă verbul este în Verbiste. | Dacă nu este, și a fost furnizat un model Scikit-Learning pre-instruit, metoda îl sună apoi pe model pentru a prezice clasa de conjugare a verbului furnizat. | Returnează un obiect Verb sau None. :param verb: string. Verbul să se conjugă. :param subject: string. Comută denumiri abstracte sau complete. Valoarea implicită este "abbrev". Selectați "pronume" pentru pronume complet. :return: Verb object or None.

source: The supplied word: {0} is not a valid verb in {1}.
es: La palabra proporcionada: {0} no es un verbo válido en {1}.
fr: Le mot fourni: {0} n'est pas un verbe valide en {1}.
it: La parola fornita: {0} non è un verbo valido in {1}.
pt: A palavra fornecida: {0} não é um verbo válido em {1}.
ro: Cuvântul furnizat: {0} nu este un verb valabil în {1}.

source: Assigns the provided pre-trained scikit-learn model to be able to conjugate unknown verbs. :param model: scikit-learn Classifier or Pipeline.
es: Asigna el modelo de aprendizaje de scikit preentrenado provisto para poder conjugar verbos desconocidos. :param model: scikit-learn Classifier or Pipeline.
fr: Assigne le modèle scikit-learn pré-entrainé fourni pour pouvoir conjuguer les verbes inconnus. :param model: scikit-learn Classifier ou Pipeline.
it: Assegna il modello pre-formato scikit-learn fornito per essere in grado di coniugare verbi sconosciuti. :param model: scikit-learn Classifier or Pipeline.
pt: Atribui o modelo scikit-learn pré-treinado fornecido para poder conjugar verbos desconhecidos. :param model: scikit-learn Classifier or Pipeline.
ro: Atribuie modelul Scikit-Learn pre-instruit furnizat pentru a putea conjuga verbe necunoscute. :param model: scikit-learn Classifier or Pipeline.

source: | Custom Vectorizer optimized for extracting verbs features. | The Vectorizer subclasses sklearn.feature_extraction.text.CountVectorizer . | As in Indo-European languages verbs are inflected by adding a morphological suffix, the vectorizer extracts verb endings and produces a vector representation of the verb with binary features. | The features are the verb ending ngrams. (ngram_range is set at class instanciation).
es: | Custom Vectorizer optimizado para extraer las características de los verbos. | Las subclases Vectorizer sklearn.feature_extraction.text.CountVectorizer. | Al igual que en los idiomas indoeuropeos, los verbos se inflan añadiendo un sufijo morfológico, el vectorizador extrae las terminaciones de los verbos y produce una representación vectorial del verbo con características binarias. | Las características son los ngrams de final del verbo. (ngram_range se establece en la instanciación de clase).
fr: | Vectorizer personnalisé optimisé pour extraire les caractéristiques des verbes. | Le Vectorizer hérite de sklearn.feature_extraction.text.CountVectorizer. | Comme dans les langues indo-européennes, les verbes sont infléchis en ajoutant un suffixe morphologique, le vectorizer extrait les terminaisons verbales et produit une représentation vectorielle du verbe avec des caractéristiques binaires. | Les caractéristiques sont la terminaison verbale ngrams. (ngram_range est défini à l'instanciation de la classe).
it: | Vectorizer personalizzato ottimizzato per l'estrazione delle caratteristiche dei verbi. | Le sottoclassi di Vectorizer sklearn.feature_extraction.text.CountVectorizer. | Come nelle lingue indoeuropee i verbi sono flessi aggiungendo un suffisso morfologico, il vettore estrae le desinenze dei verbi e produce una rappresentazione vettoriale del verbo con caratteristiche binarie. | Le caratteristiche sono i verbo che terminano con ngrams. (n-gram_range è impostato sull'istanza della classe).
pt: | Vectorizer personalizado otimizado para extrair recursos de verbos. | O vetorizador subclasse sklearn.feature_extraction.text.CountVectorizer. | Como nas línguas indo-européias os verbos são flexionados pela adição de um sufixo morfológico, o vetorizador extrai terminações verbais e produz uma representação vetorial do verbo com características binárias. | As características são os verbos ngrams. (n-gram_range é definido no instanciation de classe).
ro: | Custom Vectorizer optimizat pentru extragerea caracteristicilor verbelor. | Subclasele Vectorizer sklearn.feature_extraction.text.CountVectorizer. | Ca și în limbile indo-europene, verbele sunt influențate prin adăugarea unui sufix morfologic, vectorizatorul extrage terminațiile verbului și produce o reprezentare vectorială a verbului cu caracteristici binare. | Caracteristicile sunt verbul care sfârșește ngrams. (ngram_range este setat la instanciation de clasă).

source: Parses a verb and returns the ending ngrams. :param verb: string. Verb to vectorize. :return: list. Final ngrams of the verb.
es: Analizaun verbo y devuelve los n-gramos finales. :param verb: string. Verbo para vectorizar :return: list. N-gramos finales del verbo.
fr: Analyse un verbe et renvoie les n-grams de fin. :param verb: string. Verbe à vectoriser. :return: list. N-grammes finaux du verbe.
it: Analizza un verbo e restituisce gli n-gram finali. :param verb: string. Verbo da vettorializzare. :return: list. N-gram finali del verbo.
pt: Analisa um verbo e retorna os n-grams finais. :param verb: string. Verbo para vetorizar. :return: list. N-grams finais do verbo.
ro: Parsează un verb și returnează ngramurile terminate. :param verb: string. Verb să vectorizeze. :return: list. N-grams finale ale verbului.

source: | This class holds and manages the data set. | Defines helper functions for managing Machine Learning tasks like constructing a training and testing set. :param VerbisteObj: Instance of a Verbiste object.
es: | Esta clase contiene y administra el conjunto de datos. | Define funciones de ayuda para gestionar tareas de Aprendizaje automático, como la construcción de un conjunto de entrenamiento y prueba. :param VerbisteObj: Instancia de un objeto Verbiste.
fr: | Cette classe contient et gère l'ensemble des données. | Définit les fonctions d'assistance pour la gestion des tâches d'apprentissage automatique, telles que la construction d'un ensemble d'entrainement et de test. :param VerbisteObj: Instance d'un objet Verbiste.
it: | Questa classe contiene e gestisce il set di dati. | Definisce le funzioni di supporto per la gestione delle attività di Machine Learning come la costruzione di un set di training e test. :param VerbisteObj: Istanza di un oggetto Verbiste.
pt: | Esta classe mantém e gerencia o conjunto de dados. | Define funções auxiliares para gerenciar tarefas de Aprendizado de Máquina, como a construção de um conjunto de treinamento e teste. :param VerbisteObj: Instância de um objeto Verbiste.
ro: | Această clasă deține și gestionează setul de date. | Definește funcțiile de ajutor pentru gestionarea sarcinilor Machine Learning precum construirea unui set de instruire și testare. :param VerbisteObj: Instanța unui obiect Verbiste .

source: | Populates the dictionary containing the conjugation templates. | Populates the lists containing the verbs and their templates.
es: | Rellena el diccionario que contiene las plantillas de conjugación. | Rellena las listas que contienen los verbos y sus plantillas.
fr: | Remplit le dictionnaire contenant les classes de conjugaison. | Remplit les listes contenant les verbes et leurs classes de conjugaison.
it: | Compila il dizionario contenente i modelli di coniugazione. | Compila gli elenchi contenenti i verbi e i loro modelli.
pt: | Preenche o dicionário que contém os modelos de conjugação. | Preenche as listas que contêm os verbos e seus modelos.
ro: | Populează dicționarul care conține șabloanele de conjugare. | Folosește listele care conțin verbele și șabloanele lor.

source: Splits the data into a training and a testing set. :param threshold: int. Minimum size of conjugation class to be split. :param proportion: float. Proportion of samples in the training set. Must be between 0 and 1.
es: Divide los datos en un conjunto de entrenamiento y prueba. :param threshold: int. Tamaño mínimo de la clase de conjugación para dividir. :param proportion: float. Proporción de muestras en el conjunto de entrenamiento. Debe estar entre 0 y 1.
fr: Divise les données en un ensemble d'entrainement et de test. :param threshold: int. Taille minimale de la classe de conjugaison à diviser. :param proportion: float. Proportion d'échantillons dans l'ensemble d'apprentissage. Doit être compris entre 0 et 1.
it: Divide i dati in un training e un set di test. :param threshold: int. Dimensione minima della classe di coniugazione da dividere. :param proportion: float. Proporzione di campioni nel set di allenamento. Deve essere compreso tra 0 e 1.
pt: Divide os dados em um treinamento e um conjunto de testes. :param threshold: int. Tamanho mínimo da classe de conjugação a ser dividida. :param proportion: float. Proporção de amostras no conjunto de treinamento. Deve estar entre 0 e 1.
ro: Împărțiți datele într-un antrenament și un set de testare. :param threshold: int. Dimensiunea minimă a clasei de conjugare care trebuie divizată. :param proportion: float. Proporția probelor din setul de antrenament. Trebuie să fie între 0 și 1.

source: The split proportion must be between 0 and 1.
es: La proporción dividida debe estar entre 0 y 1.
fr: La proportion doit être comprise entre 0 et 1.
it: La proporzione divisa deve essere compresa tra 0 e 1.
pt: A proporção dividida deve estar entre 0 e 1.
ro: Proporția împărțită trebuie să fie între 0 și 1.

source: | This class manages the scikit-learn model. | The Pipeline includes a feature vectorizer, a feature selector and a classifier. | If any of the vectorizer, feature selector or classifier is not supplied at instance declaration, the __init__ method will provide good default values that get more than 92% prediction accuracy. :param vectorizer: scikit-learn Vectorizer. :param feature_selector: scikit-learn Classifier with a fit_transform() method :param classifier: scikit-learn Classifier with a predict() method
es: | Esta clase maneja el modelo scikit-learn. | El Pipeline incluye un vectorizador de características, un selector de funciones y un clasificador. | Si alguno de los vectores, selector de funciones o clasificador no se incluye en la declaración de instancia, el método __init__ proporcionará buenos valores predeterminados que obtienen más del 92% de precisión de predicción. :param vectorizer: scikit-learn Vectorizer. :param feature_selector: scikit-learn Classifier with a fit_transform() method :param classifier: scikit-learn Classifier with a predict() method
fr: | Cette classe gère le modèle scikit-learn. | Le Pipeline comprend un vectorizer de caractéristiques, un sélecteur de caractéristiques et un classificateur. | Si l'un des vectorizer, sélecteur de caractéristiques ou classificateur n'est pas fourni lors de la déclaration d'instance, la méthode __init__ fournira de bonnes valeurs par défaut qui obtiendront plus de 92% de précision de prédiction. :param vectorizer: scikit-learn Vectorizer. :param feature_selector: scikit-learn Classifier avec une méthode fit_transform () :param classifier: scikit-learn Classifier avec une méthode predict ()
it: | Questa classe gestisce il modello di apprendimento scikit. | La pipeline include un vettore di funzionalità, un selettore di funzionalità e un classificatore. | Se uno qualsiasi dei vettori, selettore di funzionalità o classificatore non viene fornito nella dichiarazione di istanza, il metodo __init__ fornirà buoni valori predefiniti che ottengono più del 92% di accuratezza di previsione. :param vectorizer: scikit-learn Vectorizer. :param feature_selector: scikit-learn Classifier with a fit_transform() method :param classifier: scikit-learn Classifier with a predict() method
pt: | Esta classe gerencia o modelo scikit-learn. | O Pipeline inclui um vetorizador de recursos, um seletor de recursos e um classificador. | Se algum vetorizador, seletor de recurso ou classificador não for fornecido na declaração de instância, o método __init__ fornecerá bons valores padrão que obtêm mais de 92% de precisão de previsão. :param vectorizer: scikit-learn Vectorizer. :param feature_selector: scikit-learn Classifier with a fit_transform() method :param classifier: scikit-learn Classifier with a predict() method
ro: | Această clasă gestionează modelul scikit-learn. | Conducta include un vectorizator de caracteristici, un selector de caracteristici și un clasificator. | Dacă oricare dintre vectorizatorul, selectorul de caracteristici sau clasificatorul nu este furnizat la declarația instanței, metoda __init__ va furniza valori implicite bune care obțin o precizie de predicție de peste 92%. :param vectorizer: scikit-learn Vectorizer. :param feature_selector: scikit-learn Classifier with a fit_transform() method :param classifier: scikit-learn Classifier with a predict() method

source: Trains the model on the supplied samples and labels. :param samples: list. List of verbs. :param labels: list. List of verb templates.
es: Entrena el modelo en las muestras y etiquetas suministradas. :param samples: list. Lista de verbos. :param labels: list. Lista de plantillas de verbos.
fr: Entraîne le modèle sur les échantillons et les labels fournis. :param samples: list. Liste des verbes :param labels: list. Liste des classes de conjugaison des verbes
it: Prepara il modello sui campioni e sulle etichette forniti. :param samples: list. Elenco dei verbi. :param labels: list. Elenco di modelli di verbo.
pt: Treina o modelo nas amostras e rótulos fornecidos. :param samples: list. Lista de verbos :param labels: list. Lista de modelos de verbos.
ro: Formează modelul pe eșantioanele și etichetele furnizate. :param samples: list. Lista verbelor. :param labels: list. Lista șabloanelor de verb.

source: Predicts the conjugation class of the provided list of verbs. :param verbs: list. List of verbs. :return: list. List of predicted conjugation groups.
es: Predice la clase de conjugación de la lista de verbos proporcionada. :param verbs: list. Lista de verbos. :return: list. Lista de grupos de conjugación predichos.
fr: Prédit la classe de conjugaison de la liste de verbes fournie. :param verbs: list. Liste des verbes :return: list. Liste des groupes de conjugaison prédits.
it: Predice la classe di coniugazione dell'elenco di verbi fornito. :param verbs: list. Elenco dei verbi. :return: list. Elenco dei gruppi di coniugazione previsti.
pt: Prevê a classe de conjugação da lista de verbos fornecida. :param verbs: list. Lista de verbos :return: list. Lista de grupos de conjugação previstos.
ro: Prezice clasa de conjugare a listei furnizate de verbe. :param verbs: list. Lista verbelor. :return: list. Lista grupurilor de conjugare prezise.

source: This is the class handling the Verbiste xml files. :param language: string. | The language of the conjugator. The default value is fr for French. | The allowed values are: fr, en, es, it, pt, ro.
es: Esta es la clase que maneja los archivos Verbiste xml. :param language: string. | El lenguaje del Conjugador. El valor predeterminado es fr para el francés. | Los valores permitidos son: fr, en, es, pt, ro.
fr: C'est la classe qui manipule les fichiers XML de Verbiste. :param language: string. | La langue du conjugateur. La valeur par défaut est fr pour le français. | Les valeurs autorisées sont: fr, en, es, it, pt, ro.
it: Questa è la classe che gestisce i file xml di Verbiste. :param language: string. | La lingua del coniugatore. Il valore predefinito è fr per il francese. | I valori consentiti sono: fr, en, es, it, pt, ro.
pt: Esta é a classe que manipula os arquivos xml da Verbiste. :param language: string. | A linguagem do conjugador. O valor padrão é fr para francês. | Os valores permitidos são: fr, en, es, pt, ro.
ro: Aceasta este clasa care manipulează fișierele xml Verbiste. :param language: string. | Limba conjugatorului. Valoarea implicită este fr pentru franceză. | Valorile admise sunt: fr, en, es, it, pt, ro.

source: Unsupported language. The allowed languages are fr, en, es, it, pt, ro.
es: Idioma no admitido. Los idiomas permitidos son fr, en, es, pt, ro.
fr: Langue non prise en charge Les langues autorisées sont fr, en, es, it, pt, ro.
it: Lingua non supportata Le lingue consentite sono fr, en, es, it, pt, ro.
pt: Idioma não suportado. Os idiomas permitidos são fr, en, es, pt, ro.
ro: Limba neacceptată. Limbile permise sunt fr, en, es, it, pt, ro.

source: Load and parses the verbs from xml file. :param verbs_file: string or path object. Path to the verbs xml file.
es: Carga y analiza los verbos del archivo xml. :param verbs_file: string or path object. Ruta del archivo de xml de los verbos.
fr: Charge et analyse les verbes du fichier XML. :param verbs_file: string or path object. Chemin vers le fichier xml des verbes.
it: Carica e analizza i verbi dal file xml. :param verbs_file: string or path object. Percorso del file xml dei verbi.
pt: Carregue e analise os verbos do arquivo xml. :param verbs_file: string or path object. Caminho para o arquivo xml de verbos.
ro: Încărcați și parse verbele din fișierul xml. :param verbs_file: string or path object. Calea spre fișierul xml verbale.
