Repository: SekouD/mlconjug
Catalog: mlconjug/locale/*/LC_MESSAGES/mlconjug.po
Languages: es, fr, it, pt, ro

source: Parses XML file :param file: FileObject. XML file containing the verbs. :return: OrderedDict. An OrderedDict containing the verb and its template for all verbs in the file.
es: Analiza el archivo XML. :param file: FileObject. Archivo XML que contiene los verbos. :return: OrderedDict. Un OrderedDict que contiene el verbo y su patrón para todos los verbos en el archivo.
fr: Analyse le fichier XML :param file: FileObject. Fichier XML contenant les verbes. :return: OrderedDict. Un OrderedDict contenant le verbe et sa classe de conjugaison pour tous les verbes du fichier.
it: Analizza il file XML :param file: FileObject. File XML contenente i verbi :return: OrderedDict. Un OrderedDict contenente il verbo e il suo modello per tutti i verbi nel file.
pt: Analisa o arquivo XML :param file: FileObject. Arquivo XML contendo os verbos. :return: OrderedDict. Um OrderedDict contendo o verbo e seu modelo para todos os verbos no arquivo.
ro: Parsează fișierul XML :param file: FileObject. Fișier XML care conține verbele. :return: OrderedDict. Un ordin ordonat conținând verbul și șablonul său pentru toate verbele din fișier.

source: | Detects the allowed endings for verbs in the supported languages. | All the supported languages except for English restrict the form a verb can take. | As English is much more productive and varied in the morphology of its verbs, any word is allowed as a verb. :return: set. A set containing the allowed endings of verbs in the target language.
es: | Detecta las permitidas terminaciones para los verbos en los idiomas admitidos. | Todos los idiomas excepto inglés restringen la forma de que un verbo puede tomar. | Como el inglés es mucho más productivo y variado en la morfología de sus verbos, se permite cualquier palabra como un verbo. :return: set. Un conjunto que contiene las terminaciones permitidas de verbos en el idioma de destino.
fr: | Détecte les terminaisonss autorisées pour les verbes dans les langues prises en charge. | Toutes les langues prises en charge à l'exception de l'anglais limitent la forme qu'un verbe peut prendre. | Comme l'anglais est beaucoup plus productif et varié dans la morphologie de ses verbes, n'importe quel mot est autorisé comme un verbe. : return: set. Un ensemble contenant les terminaisons autorisées des verbes dans la langue cible.
it: | Rileva le terminazioni consentite per i verbi nelle lingue supportate. | Tutte le lingue supportate tranne l'inglese limitano il modulo che un verbo può assumere. | Poiché l'inglese è molto più produttivo e vario nella morfologia dei suoi verbi, qualsiasi parola è consentita come un verbo. : return: set. Un set contenente le terminazioni consentite di verbi nella lingua di destinazione.
pt: | Detecta as terminações permitidas para verbos nos idiomas suportados. | Todos os idiomas suportados, exceto o inglês, restringem a forma que um verbo pode receber. | Como o inglês é muito mais produtivo e variado na morfologia de seus verbos, qualquer palavra é permitida como verbo. :return: set. Um conjunto contendo as terminações permitidas de verbos no idioma de destino.
ro: | Detectează terminațiile permise pentru verbe în limbile acceptate. | Toate limbile acceptate, cu excepția limbii engleze, restricționează forma pe care o poate lua un verb. | Deoarece limba engleză este mult mai productivă și variată în morfologia verbelor sale, orice cuvânt este permis ca verb. :return: set. Un set care conține terminalele permise ale verbelor în limba țintă.

source: | Checks if the verb is a valid verb in the given language. | English words are always treated as possible verbs. | Verbs in other languages are filtered by their endings. :param verb: string. The verb conjugate. :return: bool. True if the verb is a valid verb in the language. False otherwise.
es: | Comprueba si el verbo es un verbo válido en el idioma dado. | Las palabras en inglés siempre se tratan como posibles verbos. | Los verbos en otros idiomas se filtran por sus terminaciones. :param verb: string. El verbo para ser conjugado. :return: bool. True si el verbo es un verbo válido en el idioma. False de lo contrario.
fr: | Vérifie si le verbe est un verbe valide dans la langue donnée. | Les mots anglais sont toujours traités comme des verbes possibles. | Les verbes dans d'autres langues sont filtrés par leurs terminaisonss. :param verb: string. Le verbe a conjuguer. :return: bool. True si le verbe est un verbe valide dans la langue. False sinon.
it: | Controlla se il verbo è un verbo valido nella lingua data. | Le parole inglesi sono sempre trattate come possibili verbi. | I verbi in altre lingue sono filtrati dalle loro terminazioni. :param verb: string. Il verbo coniugare. :return: bool. True se il verbo è un verbo valido nella lingua. False altrimenti.
pt: | Verifica se o verbo é um verbo válido no idioma dado. | As palavras inglesas são sempre tratadas como verbos possíveis. | Verbos em outros idiomas são filtrados por seus finais. :param verb: string. O verbo conjugado :return: bool. True se o verbo for um verbo válido no idioma. False em contrário.
ro: | Verifică dacă verbul este un verb valabil în limba dată. | Cuvintele în limba engleză sunt tratate întotdeauna ca verbe posibile. | Verbe în alte limbi sunt filtrate după terminările lor. :param verb: string. Verbul conjugat. :return: bool. Adevărat dacă verbul este un verb valabil în limba respectivă. Fals altfel.

source: Load and parses the conjugations from xml file. :param conjugations_file: string or path object. Path to the conjugation xml file.
es: Cargue y analiza las conjugaciones del archivo xml. :param conjugations_file: string or path object. Ruta al archivo xml de conjugación.
fr: Charge et analyse les conjugaisons à partir du fichier XML. :param conjugations_file: string or path object. Chemin vers le fichier XML de conjugaison.
it: Carica e analizza le coniugazioni dal file xml. :param conjugations_file: string or path object. Percorso del file xml di coniugazione.
pt: Carregue e analise as conjugações do arquivo xml. :param conjugations_file: string or path object. Caminho para o arquivo xml de conjugação.
ro: Încarcă și analizează conjugările din fișierul xml. :param conjugations_file: string or path object. Calea spre fișierul xml de conjugare.

source: Parses XML file :param file: FileObject. XML file containing the conjugation templates :return: OrderedDict. An OrderedDict containing all the conjugation templates in the file.
es: Analiza el archivo XML. :param file: FileObject. Archivo XML que contiene las patrónes de conjugación. :return: OrderedDict. Un OrderedDict que contiene todas las patrónes de conjugación en el archivo.
fr: Analyse le fichier XML :param file: FileObject. Fichier XML contenant les classes de conjugaison :return: OrderedDict. Un OrderedDict contenant toutes les classes de conjugaison dans le fichier.
it: Analizza il file XML :param file: FileObject. File XML contenente i modelli di coniugazione :return: OrderedDict. Un OrderedDict contenente tutti i modelli di coniugazione nel file.
pt: Analisa o arquivo XML :param file: FileObject. Arquivo XML contendo os modelos de conjugação :return: OrderedDict. Um OrderedDict contendo todos os modelos de conjugação no arquivo.
ro: Parsează fișierul XML :param file: FileObject. Fișier XML care conține șabloanele de conjugare :return: OrderedDict. Un ordin ordonat care conține toate șabloanele de conjugare din fișier.

source: Load and parses the inflected forms of the tense from xml file. :param tense: string. The current tense being processed. :return: list. List of conjugated suffixes.
es: Carga y analiza las formas derivadas del tiempo de archivo xml. :param tense: string. El tiempo actual está procesando. :return: list. Lista de sufijos conjugados.
fr: Charge et analyse les formes fléchies du temps à partir du fichier xml. :param tense: string. Le temps en cours de traitement. :return: list. Liste des suffixes conjugués.
it: Carica e analizza le forme flesse del tempo dal file xml. :param tense: string. Il tempo corrente in elaborazione. :return: list. Elenco di suffissi coniugati.
pt: Carregue e analise os formulários flexionados do tempo do arquivo xml. :param tense: string. O tempo atual sendo processado. :return: list. Lista de sufixos conjugados.
ro: Încarcă și analizează formele inflexionate ale timpului din fișierul xml. :param tense: string. Timpul curent este procesat. :return: list. Lista sufixelor conjugate.

source: Gets verb information and returns a VerbInfo instance. :param verb: string. Verb to conjugate. :return: VerbInfo object or None.
es: Obtiene información de verbo y devuelve una instancia de VerbInfo. :param verb: string. Verbo a conjugar. :return: VerbInfo object or None.
fr: Récupère les informations du verbe et renvoie une instance de VerbInfo. :param verb: string. Verbe à conjuguer. :return: VerbInfo object or None.
it: Ottiene informazioni sui verbi e restituisce un'istanza de VerbInfo. :param verb: string. Verbo da coniugare. :return: VerbInfo object or None.
pt: Obtém informações verbais e retorna uma instância de VerbInfo. :param verb: string. Verbo para conjugar. :return: VerbInfo object or None.
ro: Obține informații verbale și returnează o instanță VerbInfo. :param verb: string. Verbul să se conjugă. :return: VerbInfo object or None.

source: Gets conjugation information corresponding to the given template. :param template: string. Name of the verb ending pattern. :return: OrderedDict or None. OrderedDict containing the conjugated suffixes of the template.
es: Obtiene información verbal correspondiente a la patron determinada. :param template: string. Nombre del verbo acabar con patrón. :return: OrderedDict or None. OrderedDict que contiene el conjugado sufijos de la patrón.
fr: Récupère les informations de conjugaison correspondant à la classe de conjugaison donnée. :param template: string. Nom de la classe de conjugaison du verbe. :return: OrderedDict or None. OrderedDict contenant les suffixes conjugués de la classe de conjugaison.
it: Ottiene informazioni di coniugazione corrispondenti al modello specificato. :param template: string. Nome del modello di fine del verbo. :return: OrderedDict or None. OrderedDict contenente i suffissi coniugati del modello.
pt: Obtém informações de conjugação correspondentes ao modelo fornecido. :param template: string. Nome do padrão final do verbo. :return: OrderedDict or None. OrderedDict contendo os sufixos conjugados do modelo.
ro: Obține informații de conjugare corespunzătoare șablonului dat. :param template: string. Numele modelului de terminare a verbului. :return: OrderedDict or None. OrdonatDict conținând sufixele conjugate ale șablonului.

source: This class defines the Verbiste verb information structure. :param infinitive: string. Infinitive form of the verb. :param root: string. Lexical root of the verb. :param template: string. Name of the verb ending pattern.
es: Esta clase define la estructura de información del verbo en Verbiste. :param infinitive: string. Forma infinitiva del verbo :param root: string. Raíz léxica del verbo. :param template: string. Nombre del verbo finalizando patrón.
fr: Cette classe définit la structure d'information du verbe dans Verbiste. :param infinitive: string. Forme infinitive du verbe. :param root: string. Racine lexicale du verbe. :param template: string. Nom de la classe de conjugaison du verbe.
it: Questa classe definisce la struttura delle informazioni del verbo del Verbiste. :param infinitive: string. Forma infinita del verbo :param root: string. Radice lessicale del verbo. :param template: string. Nome del modello di fine del verbo.
pt: Essa classe define a estrutura de informações verbais do Verbiste. :param infinitive: string. Forma Infinitiva do Verbo. :param root: string. Raiz lexical do verbo. :param template: string. Nome do padrão final do verbo.
ro: Această clasă definește structura informațională a Verbiste. :param infinitive: string. Forma infinitivă a verbului. :param root: string. Rădăcina lexicală a verbului. :param template: string. Numele modelului de terminare a verbului.

source: This class defines the Verb Object. :param verb_info: VerbInfo Object. :param conjug_info: OrderedDict. :param subject: string. Toggles abbreviated or full pronouns. The default value is 'abbrev'. Select 'pronoun' for full pronouns.
es: Esta clase define el Objeto Verb. :param verb_info: VerbInfo Object. :param conjug_info: OrderedDict. :param subject: string. Cambia abreviado o completo pronombres. El valor predeterminado es 'abreviatura'. Seleccione 'pronombre' para pronombres completos.
fr: Cette classe définit l'objet Verb. :param verb_info: VerbInfo Object. :param conjug_info: OrderedDict. :param subject: string. Bascule les pronoms abrégés ou complets. La valeur par défaut est 'abbrev'. Sélectionnez "pronom" pour les pronoms complets.
it: Questa classe definisce l'oggetto Verb. :param verb_info: VerbInfo Object. :param conjug_info: OrderedDict. :param subject: string. Attiva i pronomi abbreviati o pieni. Il valore predefinito è 'abbrev'. Seleziona "pronome" per i pronomi completi.
pt: Esta classe define o Objeto Verb. :param verb_info: VerbInfo Object. :param conjug_info: OrderedDict. :param subject: string. Ativa os pronomes abreviados ou completos. O valor padrão é 'abrev'. Selecione 'pronome' para pronomes completos.
ro: Această clasă definește obiectul Verb. :param verb_info: VerbInfo Object. :param conjug_info: OrderedDict. :param subject: string. Comută denumiri abstracte sau complete. Valoarea implicită este "abbrev". Selectați "pronume" pentru pronume complet.

source: | Populates the inflected forms of the verb. | This is the generic version of this method. | It does not add personal pronouns to the conjugated forms. | This method can handle any new language if the conjugation structure conforms to the Verbiste XML Schema.
es: | Rellena las formas flexionadas del verbo. | Esta es la versión genérica de este método. | No agrega pronombres personales a las formas conjugadas. | Este método puede manejar cualquier idioma nuevo si la estructura de conjugación se ajusta al esquema XML de Verbiste.
fr: | Remplit les formes fléchies du verbe. | C'est la version générique de cette méthode. | Cette méthode n'ajoute pas de pronoms personnels aux formes conjuguées. | Cette méthode peut gérer n'importe quel nouvelle langue si la structure de conjugaison est conforme au schéma XML de Verbiste.
it: | Compila le forme flesse del verbo. | Questa è la versione generica di questo metodo. | Non aggiunge pronomi personali alle forme coniugate. | Questo metodo può gestire qualsiasi nuovo linguaggio se la struttura di coniugazione è conforme allo schema XML di Verbiste.
pt: | Popula as formas flexionadas do verbo. | Esta é a versão genérica desse método. | Não adiciona pronomes pessoais às formas conjugadas. | Esse método pode manipular qualquer novo idioma se a estrutura de conjugação estiver em conformidade com o Esquema XML da Verbiste.
ro: | Populează formele inflamate ale verbului. | Aceasta este versiunea generică a acestei metode. | Nu adaugă pronume personale forțelor conjugate. | Această metodă poate gestiona orice limbă nouă dacă structura de conjugare este conformă cu Schema XML Verbiste.

source: This class defines the French Verb Object.
es: Esta clase define el Objeto Verb francés.
fr: Cette classe définit l'objet Verb français.
it: Questa classe definisce l'oggetto Verb francese.
pt: Esta classe define o Objeto Verb Francês.
ro: Această clasă definește Obiectul de Verb franțuzesc.

source: | Populates the inflected forms of the verb. | Adds personal pronouns to the inflected verbs.
es: | Rellena las formas flexionadas del verbo. | Agrega pronombres personales a los verbos inflexos.
fr: | Remplit les formes fléchies du verbe. | Ajoute les pronoms personnels aux verbes fléchis.
it: | Compila le forme flesse del verbo. | Aggiunge pronomi personali ai verbi inflessi.
pt: | Popula as formas flexionadas do verbo. | Adiciona pronomes pessoais aos verbos flexionados.
ro: | Populează formele inflamate ale verbului. | Adaugă pronume personale la verbele inflaționate.

source: This class defines the English Verb Object.
es: Esta clase define el Objeto Verb inglés.
fr: Cette classe définit l'objet Verb anglais.
it: Questa classe definisce l'oggetto Verb inglese.
pt: Esta classe define o Objeto Verb em Inglês.
ro: Această clasă definește Obiectul englez de Verb.

source: This class defines the Spanish Verb Object.
es: Esta clase define el Objeto Verb Español.
fr: Cette classe définit l'objet Verb espagnol.
it: Questa classe definisce l'oggetto Verb spagnolo.
pt: Esta classe define o Objeto Verb Espanhol.
ro: Această clasă definește Obiectul Verb spaniol.

source: This class defines the Italian Verb Object.
es: Esta clase define el Objeto Verb italiano.
fr: Cette classe définit l'objet Verb italien.
it: Questa classe definisce l'oggetto Verb italiano.
pt: Esta classe define o Objeto Verb Italiano.
ro: Această clasă definește Obiectul Verb italian.

source: This class defines the Portuguese Verb Object.
es: Esta clase define el Objeto Verb portugués.
fr: Cette classe définit l'objet Verb portugais.
it: Questa classe definisce l'oggetto Verb Portoghese.
pt: Esta classe define o Objeto Verb português.
ro: Această clasă definește Obiectul Verb portughez.

source: This class defines the Romanian Verb Object.
es: Esta clase define el Objeto Verbo Rumano.
fr: Cette classe définit l'objet Verb roumain.
it: Questa classe definisce l'oggetto Verb rumeno.
pt: Esta classe define o Objeto Verbo romeno.
ro: Această clasă definește Obiectul Verb românesc.

source: The language for the conjugation model. The values can be fr, en, es, it, pt or ro. The default value is fr.
es: El lenguaje para el modelo de conjugación. Los valores pueden ser fr, en, es, it, pt o ro. El valor predeterminado es fr.
fr: La langue du modèle de conjugaison. Les valeurs peuvent être fr, en, es, it, pt ou ro. La valeur par défaut est fr.
it: La lingua per il modello di coniugazione. I valori possono essere fr, en, es, it, pt o ro. Il valore predefinito è fr.
pt: A linguagem para o modelo de conjugação. Os valores podem ser fr, en, es, pt ou ro. O valor padrão é fr.
ro: Limba pentru modelul de conjugare. Valorile pot fi fr, en, es, it, pt sau ro. Valoarea implicită este fr.

source: Console script for mlconjug.
es: Script de consola para mlconjug.
fr: Script de console pour mlconjug.
it: Script della console per mlconjug.
pt: Script de console para o mlconjug.
ro: Consola script pentru mlconjug.
